MikroElektronika/core_packages/PIC/XC8/def/PIC16F1776/mcu.h
extern volatile DAC1REFHbits_t DAC1REFHbits __at(0x590);
// bitfield macros
#define _DAC1REFH_REF_POSN                                  0x0
#define _DAC1REFH_REF_POSITION                              0x0
#define _DAC1REFH_REF_SIZE                                  0x8
#define _DAC1REFH_REF_LENGTH                                0x8
#define _DAC1REFH_REF_MASK                                  0xFF
#define _DAC1REFH_DAC1REF8_POSN                             0x0
#define _DAC1REFH_DAC1REF8_POSITION                         0x0
#define _DAC1REFH_DAC1REF8_SIZE                             0x1
#define _DAC1REFH_DAC1REF8_LENGTH                           0x1
#define _DAC1REFH_DAC1REF8_MASK                             0x1
#define _DAC1REFH_DAC1REF9_POSN                             0x1
#define _DAC1REFH_DAC1REF9_POSITION                         0x1
#define _DAC1REFH_DAC1REF9_SIZE                             0x1
#define _DAC1REFH_DAC1REF9_LENGTH                           0x1
#define _DAC1REFH_DAC1REF9_MASK                             0x2
#define _DAC1REFH_DAC1REF10_POSN                            0x2
#define _DAC1REFH_DAC1REF10_POSITION                        0x2
#define _DAC1REFH_DAC1REF10_SIZE                            0x1
#define _DAC1REFH_DAC1REF10_LENGTH                          0x1
#define _DAC1REFH_DAC1REF10_MASK                            0x4
#define _DAC1REFH_DAC1REF11_POSN                            0x3
#define _DAC1REFH_DAC1REF11_POSITION                        0x3
#define _DAC1REFH_DAC1REF11_SIZE                            0x1
#define _DAC1REFH_DAC1REF11_LENGTH                          0x1
#define _DAC1REFH_DAC1REF11_MASK                            0x8
#define _DAC1REFH_DAC1REF12_POSN                            0x4
#define _DAC1REFH_DAC1REF12_POSITION                        0x4
#define _DAC1REFH_DAC1REF12_SIZE                            0x1
#define _DAC1REFH_DAC1REF12_LENGTH                          0x1
#define _DAC1REFH_DAC1REF12_MASK                            0x10
#define _DAC1REFH_DAC1REF13_POSN                            0x5
#define _DAC1REFH_DAC1REF13_POSITION                        0x5
#define _DAC1REFH_DAC1REF13_SIZE                            0x1
#define _DAC1REFH_DAC1REF13_LENGTH                          0x1
#define _DAC1REFH_DAC1REF13_MASK                            0x20
#define _DAC1REFH_DAC1REF14_POSN                            0x6
#define _DAC1REFH_DAC1REF14_POSITION                        0x6
#define _DAC1REFH_DAC1REF14_SIZE                            0x1
#define _DAC1REFH_DAC1REF14_LENGTH                          0x1
#define _DAC1REFH_DAC1REF14_MASK                            0x40
#define _DAC1REFH_DAC1REF15_POSN                            0x7
#define _DAC1REFH_DAC1REF15_POSITION                        0x7
#define _DAC1REFH_DAC1REF15_SIZE                            0x1
#define _DAC1REFH_DAC1REF15_LENGTH                          0x1
#define _DAC1REFH_DAC1REF15_MASK                            0x80
#define _DAC1REFH_R8_POSN                                   0x0
#define _DAC1REFH_R8_POSITION                               0x0
#define _DAC1REFH_R8_SIZE                                   0x1
#define _DAC1REFH_R8_LENGTH                                 0x1
#define _DAC1REFH_R8_MASK                                   0x1
#define _DAC1REFH_R9_POSN                                   0x1
#define _DAC1REFH_R9_POSITION                               0x1
#define _DAC1REFH_R9_SIZE                                   0x1
#define _DAC1REFH_R9_LENGTH                                 0x1
#define _DAC1REFH_R9_MASK                                   0x2
#define _DAC1REFH_R10_POSN                                  0x2
#define _DAC1REFH_R10_POSITION                              0x2
#define _DAC1REFH_R10_SIZE                                  0x1
#define _DAC1REFH_R10_LENGTH                                0x1
#define _DAC1REFH_R10_MASK                                  0x4
#define _DAC1REFH_R11_POSN                                  0x3
#define _DAC1REFH_R11_POSITION                              0x3
#define _DAC1REFH_R11_SIZE                                  0x1
#define _DAC1REFH_R11_LENGTH                                0x1
#define _DAC1REFH_R11_MASK                                  0x8
#define _DAC1REFH_R12_POSN                                  0x4
#define _DAC1REFH_R12_POSITION                              0x4
#define _DAC1REFH_R12_SIZE                                  0x1
#define _DAC1REFH_R12_LENGTH                                0x1
#define _DAC1REFH_R12_MASK                                  0x10
#define _DAC1REFH_R13_POSN                                  0x5
#define _DAC1REFH_R13_POSITION                              0x5
#define _DAC1REFH_R13_SIZE                                  0x1
#define _DAC1REFH_R13_LENGTH                                0x1
#define _DAC1REFH_R13_MASK                                  0x20
#define _DAC1REFH_R14_POSN                                  0x6
#define _DAC1REFH_R14_POSITION                              0x6
#define _DAC1REFH_R14_SIZE                                  0x1
#define _DAC1REFH_R14_LENGTH                                0x1
#define _DAC1REFH_R14_MASK                                  0x40
#define _DAC1REFH_R15_POSN                                  0x7
#define _DAC1REFH_R15_POSITION                              0x7
#define _DAC1REFH_R15_SIZE                                  0x1
#define _DAC1REFH_R15_LENGTH                                0x1
#define _DAC1REFH_R15_MASK                                  0x80
#define _DAC1REFH_DAC1R8_POSN                               0x0
#define _DAC1REFH_DAC1R8_POSITION                           0x0
#define _DAC1REFH_DAC1R8_SIZE                               0x1
#define _DAC1REFH_DAC1R8_LENGTH                             0x1
#define _DAC1REFH_DAC1R8_MASK                               0x1
#define _DAC1REFH_DAC1R9_POSN                               0x1
#define _DAC1REFH_DAC1R9_POSITION                           0x1
#define _DAC1REFH_DAC1R9_SIZE                               0x1
#define _DAC1REFH_DAC1R9_LENGTH                             0x1
#define _DAC1REFH_DAC1R9_MASK                               0x2
#define _DAC1REFH_DAC1R10_POSN                              0x2
#define _DAC1REFH_DAC1R10_POSITION                          0x2
#define _DAC1REFH_DAC1R10_SIZE                              0x1
#define _DAC1REFH_DAC1R10_LENGTH                            0x1
#define _DAC1REFH_DAC1R10_MASK                              0x4
#define _DAC1REFH_DAC1R11_POSN                              0x3
#define _DAC1REFH_DAC1R11_POSITION                          0x3
#define _DAC1REFH_DAC1R11_SIZE                              0x1
#define _DAC1REFH_DAC1R11_LENGTH                            0x1
#define _DAC1REFH_DAC1R11_MASK                              0x8
#define _DAC1REFH_DAC1R12_POSN                              0x4
#define _DAC1REFH_DAC1R12_POSITION                          0x4
#define _DAC1REFH_DAC1R12_SIZE                              0x1
#define _DAC1REFH_DAC1R12_LENGTH                            0x1
#define _DAC1REFH_DAC1R12_MASK                              0x10
#define _DAC1REFH_DAC1R13_POSN                              0x5
#define _DAC1REFH_DAC1R13_POSITION                          0x5
#define _DAC1REFH_DAC1R13_SIZE                              0x1
#define _DAC1REFH_DAC1R13_LENGTH                            0x1
#define _DAC1REFH_DAC1R13_MASK                              0x20
#define _DAC1REFH_DAC1R14_POSN                              0x6
#define _DAC1REFH_DAC1R14_POSITION                          0x6
#define _DAC1REFH_DAC1R14_SIZE                              0x1
#define _DAC1REFH_DAC1R14_LENGTH                            0x1
#define _DAC1REFH_DAC1R14_MASK                              0x40
#define _DAC1REFH_DAC1R15_POSN                              0x7
#define _DAC1REFH_DAC1R15_POSITION                          0x7
#define _DAC1REFH_DAC1R15_SIZE                              0x1
#define _DAC1REFH_DAC1R15_LENGTH                            0x1
#define _DAC1REFH_DAC1R15_MASK                              0x80
#define _DAC1REFH_REF8_POSN                                 0x0
#define _DAC1REFH_REF8_POSITION                             0x0
#define _DAC1REFH_REF8_SIZE                                 0x1
#define _DAC1REFH_REF8_LENGTH                               0x1
#define _DAC1REFH_REF8_MASK                                 0x1
#define _DAC1REFH_REF9_POSN                                 0x1
#define _DAC1REFH_REF9_POSITION                             0x1
#define _DAC1REFH_REF9_SIZE                                 0x1
#define _DAC1REFH_REF9_LENGTH                               0x1
#define _DAC1REFH_REF9_MASK                                 0x2
#define _DAC1REFH_REF10_POSN                                0x2
#define _DAC1REFH_REF10_POSITION                            0x2
#define _DAC1REFH_REF10_SIZE                                0x1
#define _DAC1REFH_REF10_LENGTH                              0x1
#define _DAC1REFH_REF10_MASK                                0x4
#define _DAC1REFH_REF11_POSN                                0x3
#define _DAC1REFH_REF11_POSITION                            0x3
#define _DAC1REFH_REF11_SIZE                                0x1
#define _DAC1REFH_REF11_LENGTH                              0x1
#define _DAC1REFH_REF11_MASK                                0x8
#define _DAC1REFH_REF12_POSN                                0x4
#define _DAC1REFH_REF12_POSITION                            0x4
#define _DAC1REFH_REF12_SIZE                                0x1
#define _DAC1REFH_REF12_LENGTH                              0x1
#define _DAC1REFH_REF12_MASK                                0x10
#define _DAC1REFH_REF13_POSN                                0x5
#define _DAC1REFH_REF13_POSITION                            0x5
#define _DAC1REFH_REF13_SIZE                                0x1
#define _DAC1REFH_REF13_LENGTH                              0x1
#define _DAC1REFH_REF13_MASK                                0x20
#define _DAC1REFH_REF14_POSN                                0x6
#define _DAC1REFH_REF14_POSITION                            0x6
#define _DAC1REFH_REF14_SIZE                                0x1
#define _DAC1REFH_REF14_LENGTH                              0x1
#define _DAC1REFH_REF14_MASK                                0x40
#define _DAC1REFH_REF15_POSN                                0x7
#define _DAC1REFH_REF15_POSITION                            0x7
#define _DAC1REFH_REF15_SIZE                                0x1
#define _DAC1REFH_REF15_LENGTH                              0x1
#define _DAC1REFH_REF15_MASK                                0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned REF                    :8;
    };
    struct {
        unsigned DAC1REF8               :1;
        unsigned DAC1REF9               :1;
        unsigned DAC1REF10              :1;
        unsigned DAC1REF11              :1;
        unsigned DAC1REF12              :1;
        unsigned DAC1REF13              :1;
        unsigned DAC1REF14              :1;
        unsigned DAC1REF15              :1;
    };
    struct {
        unsigned R8                     :1;
        unsigned R9                     :1;
        unsigned R10                    :1;
        unsigned R11                    :1;
        unsigned R12                    :1;
        unsigned R13                    :1;
        unsigned R14                    :1;
        unsigned R15                    :1;
    };
    struct {
        unsigned DAC1R8                 :1;
        unsigned DAC1R9                 :1;
        unsigned DAC1R10                :1;
        unsigned DAC1R11                :1;
        unsigned DAC1R12                :1;
        unsigned DAC1R13                :1;
        unsigned DAC1R14                :1;
        unsigned DAC1R15                :1;
    };
    struct {
        unsigned REF8                   :1;
        unsigned REF9                   :1;
        unsigned REF10                  :1;
        unsigned REF11                  :1;
        unsigned REF12                  :1;
        unsigned REF13                  :1;
        unsigned REF14                  :1;
        unsigned REF15                  :1;
    };
} DAC1CON2bits_t;
