MikroElektronika/core_packages/PIC/XC8/def/PIC16F1776/mcu.h
// Register: DAC2REFL
#define DAC2REFL DAC2REFL
extern volatile unsigned char           DAC2REFL            __at(0x592);
#ifndef _LIB_BUILD
asm("DAC2REFL equ 0592h");
#endif
// aliases
extern volatile unsigned char           DAC2CON1            __at(0x592);
#ifndef _LIB_BUILD
asm("DAC2CON1 equ 0592h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned REF                    :8;
    };
    struct {
        unsigned DAC2REF0               :1;
        unsigned DAC2REF1               :1;
        unsigned DAC2REF2               :1;
        unsigned DAC2REF3               :1;
        unsigned DAC2REF4               :1;
        unsigned DAC2REF5               :1;
        unsigned DAC2REF6               :1;
        unsigned DAC2REF7               :1;
    };
    struct {
        unsigned R0                     :1;
        unsigned R1                     :1;
        unsigned R2                     :1;
        unsigned R3                     :1;
        unsigned R4                     :1;
        unsigned R5                     :1;
        unsigned R6                     :1;
        unsigned R7                     :1;
    };
    struct {
        unsigned DAC2R0                 :1;
        unsigned DAC2R1                 :1;
        unsigned DAC2R2                 :1;
        unsigned DAC2R3                 :1;
        unsigned DAC2R4                 :1;
        unsigned DAC2R5                 :1;
        unsigned DAC2R6                 :1;
        unsigned DAC2R7                 :1;
    };
    struct {
        unsigned REF0                   :1;
        unsigned REF1                   :1;
        unsigned REF2                   :1;
        unsigned REF3                   :1;
        unsigned REF4                   :1;
        unsigned REF5                   :1;
        unsigned REF6                   :1;
        unsigned REF7                   :1;
    };
} DAC2REFLbits_t;
extern volatile DAC2REFLbits_t DAC2REFLbits __at(0x592);
// bitfield macros
#define _DAC2REFL_REF_POSN                                  0x0
#define _DAC2REFL_REF_POSITION                              0x0
#define _DAC2REFL_REF_SIZE                                  0x8
#define _DAC2REFL_REF_LENGTH                                0x8
#define _DAC2REFL_REF_MASK                                  0xFF
#define _DAC2REFL_DAC2REF0_POSN                             0x0
#define _DAC2REFL_DAC2REF0_POSITION                         0x0
#define _DAC2REFL_DAC2REF0_SIZE                             0x1
#define _DAC2REFL_DAC2REF0_LENGTH                           0x1
#define _DAC2REFL_DAC2REF0_MASK                             0x1
#define _DAC2REFL_DAC2REF1_POSN                             0x1
#define _DAC2REFL_DAC2REF1_POSITION                         0x1
#define _DAC2REFL_DAC2REF1_SIZE                             0x1
#define _DAC2REFL_DAC2REF1_LENGTH                           0x1
#define _DAC2REFL_DAC2REF1_MASK                             0x2
#define _DAC2REFL_DAC2REF2_POSN                             0x2
#define _DAC2REFL_DAC2REF2_POSITION                         0x2
#define _DAC2REFL_DAC2REF2_SIZE                             0x1
#define _DAC2REFL_DAC2REF2_LENGTH                           0x1
#define _DAC2REFL_DAC2REF2_MASK                             0x4
#define _DAC2REFL_DAC2REF3_POSN                             0x3
#define _DAC2REFL_DAC2REF3_POSITION                         0x3
#define _DAC2REFL_DAC2REF3_SIZE                             0x1
#define _DAC2REFL_DAC2REF3_LENGTH                           0x1
#define _DAC2REFL_DAC2REF3_MASK                             0x8
#define _DAC2REFL_DAC2REF4_POSN                             0x4
#define _DAC2REFL_DAC2REF4_POSITION                         0x4
#define _DAC2REFL_DAC2REF4_SIZE                             0x1
#define _DAC2REFL_DAC2REF4_LENGTH                           0x1
#define _DAC2REFL_DAC2REF4_MASK                             0x10
#define _DAC2REFL_DAC2REF5_POSN                             0x5
#define _DAC2REFL_DAC2REF5_POSITION                         0x5
#define _DAC2REFL_DAC2REF5_SIZE                             0x1
#define _DAC2REFL_DAC2REF5_LENGTH                           0x1
#define _DAC2REFL_DAC2REF5_MASK                             0x20
#define _DAC2REFL_DAC2REF6_POSN                             0x6
#define _DAC2REFL_DAC2REF6_POSITION                         0x6
#define _DAC2REFL_DAC2REF6_SIZE                             0x1
#define _DAC2REFL_DAC2REF6_LENGTH                           0x1
#define _DAC2REFL_DAC2REF6_MASK                             0x40
#define _DAC2REFL_DAC2REF7_POSN                             0x7
#define _DAC2REFL_DAC2REF7_POSITION                         0x7
#define _DAC2REFL_DAC2REF7_SIZE                             0x1
#define _DAC2REFL_DAC2REF7_LENGTH                           0x1
#define _DAC2REFL_DAC2REF7_MASK                             0x80
#define _DAC2REFL_R0_POSN                                   0x0
#define _DAC2REFL_R0_POSITION                               0x0
#define _DAC2REFL_R0_SIZE                                   0x1
#define _DAC2REFL_R0_LENGTH                                 0x1
#define _DAC2REFL_R0_MASK                                   0x1
#define _DAC2REFL_R1_POSN                                   0x1
#define _DAC2REFL_R1_POSITION                               0x1
#define _DAC2REFL_R1_SIZE                                   0x1
#define _DAC2REFL_R1_LENGTH                                 0x1
#define _DAC2REFL_R1_MASK                                   0x2
#define _DAC2REFL_R2_POSN                                   0x2
#define _DAC2REFL_R2_POSITION                               0x2
#define _DAC2REFL_R2_SIZE                                   0x1
#define _DAC2REFL_R2_LENGTH                                 0x1
#define _DAC2REFL_R2_MASK                                   0x4
#define _DAC2REFL_R3_POSN                                   0x3
#define _DAC2REFL_R3_POSITION                               0x3
#define _DAC2REFL_R3_SIZE                                   0x1
#define _DAC2REFL_R3_LENGTH                                 0x1
#define _DAC2REFL_R3_MASK                                   0x8
#define _DAC2REFL_R4_POSN                                   0x4
#define _DAC2REFL_R4_POSITION                               0x4
#define _DAC2REFL_R4_SIZE                                   0x1
#define _DAC2REFL_R4_LENGTH                                 0x1
#define _DAC2REFL_R4_MASK                                   0x10
#define _DAC2REFL_R5_POSN                                   0x5
#define _DAC2REFL_R5_POSITION                               0x5
#define _DAC2REFL_R5_SIZE                                   0x1
#define _DAC2REFL_R5_LENGTH                                 0x1
#define _DAC2REFL_R5_MASK                                   0x20
#define _DAC2REFL_R6_POSN                                   0x6
#define _DAC2REFL_R6_POSITION                               0x6
#define _DAC2REFL_R6_SIZE                                   0x1
#define _DAC2REFL_R6_LENGTH                                 0x1
#define _DAC2REFL_R6_MASK                                   0x40
#define _DAC2REFL_R7_POSN                                   0x7
#define _DAC2REFL_R7_POSITION                               0x7
#define _DAC2REFL_R7_SIZE                                   0x1
#define _DAC2REFL_R7_LENGTH                                 0x1
#define _DAC2REFL_R7_MASK                                   0x80
#define _DAC2REFL_DAC2R0_POSN                               0x0
#define _DAC2REFL_DAC2R0_POSITION                           0x0
#define _DAC2REFL_DAC2R0_SIZE                               0x1
#define _DAC2REFL_DAC2R0_LENGTH                             0x1
#define _DAC2REFL_DAC2R0_MASK                               0x1
#define _DAC2REFL_DAC2R1_POSN                               0x1
#define _DAC2REFL_DAC2R1_POSITION                           0x1
#define _DAC2REFL_DAC2R1_SIZE                               0x1
#define _DAC2REFL_DAC2R1_LENGTH                             0x1
#define _DAC2REFL_DAC2R1_MASK                               0x2
#define _DAC2REFL_DAC2R2_POSN                               0x2
#define _DAC2REFL_DAC2R2_POSITION                           0x2
#define _DAC2REFL_DAC2R2_SIZE                               0x1
#define _DAC2REFL_DAC2R2_LENGTH                             0x1
#define _DAC2REFL_DAC2R2_MASK                               0x4
#define _DAC2REFL_DAC2R3_POSN                               0x3
#define _DAC2REFL_DAC2R3_POSITION                           0x3
#define _DAC2REFL_DAC2R3_SIZE                               0x1
#define _DAC2REFL_DAC2R3_LENGTH                             0x1
#define _DAC2REFL_DAC2R3_MASK                               0x8
#define _DAC2REFL_DAC2R4_POSN                               0x4
#define _DAC2REFL_DAC2R4_POSITION                           0x4
#define _DAC2REFL_DAC2R4_SIZE                               0x1
#define _DAC2REFL_DAC2R4_LENGTH                             0x1
#define _DAC2REFL_DAC2R4_MASK                               0x10
#define _DAC2REFL_DAC2R5_POSN                               0x5
#define _DAC2REFL_DAC2R5_POSITION                           0x5
#define _DAC2REFL_DAC2R5_SIZE                               0x1
#define _DAC2REFL_DAC2R5_LENGTH                             0x1
#define _DAC2REFL_DAC2R5_MASK                               0x20
#define _DAC2REFL_DAC2R6_POSN                               0x6
#define _DAC2REFL_DAC2R6_POSITION                           0x6
#define _DAC2REFL_DAC2R6_SIZE                               0x1
#define _DAC2REFL_DAC2R6_LENGTH                             0x1
#define _DAC2REFL_DAC2R6_MASK                               0x40
#define _DAC2REFL_DAC2R7_POSN                               0x7
#define _DAC2REFL_DAC2R7_POSITION                           0x7
#define _DAC2REFL_DAC2R7_SIZE                               0x1
#define _DAC2REFL_DAC2R7_LENGTH                             0x1
#define _DAC2REFL_DAC2R7_MASK                               0x80
#define _DAC2REFL_REF0_POSN                                 0x0
#define _DAC2REFL_REF0_POSITION                             0x0
#define _DAC2REFL_REF0_SIZE                                 0x1
#define _DAC2REFL_REF0_LENGTH                               0x1
#define _DAC2REFL_REF0_MASK                                 0x1
#define _DAC2REFL_REF1_POSN                                 0x1
#define _DAC2REFL_REF1_POSITION                             0x1
#define _DAC2REFL_REF1_SIZE                                 0x1
#define _DAC2REFL_REF1_LENGTH                               0x1
#define _DAC2REFL_REF1_MASK                                 0x2
#define _DAC2REFL_REF2_POSN                                 0x2
#define _DAC2REFL_REF2_POSITION                             0x2
#define _DAC2REFL_REF2_SIZE                                 0x1
#define _DAC2REFL_REF2_LENGTH                               0x1
#define _DAC2REFL_REF2_MASK                                 0x4
#define _DAC2REFL_REF3_POSN                                 0x3
#define _DAC2REFL_REF3_POSITION                             0x3
#define _DAC2REFL_REF3_SIZE                                 0x1
#define _DAC2REFL_REF3_LENGTH                               0x1
#define _DAC2REFL_REF3_MASK                                 0x8
#define _DAC2REFL_REF4_POSN                                 0x4
#define _DAC2REFL_REF4_POSITION                             0x4
#define _DAC2REFL_REF4_SIZE                                 0x1
#define _DAC2REFL_REF4_LENGTH                               0x1
#define _DAC2REFL_REF4_MASK                                 0x10
#define _DAC2REFL_REF5_POSN                                 0x5
#define _DAC2REFL_REF5_POSITION                             0x5
#define _DAC2REFL_REF5_SIZE                                 0x1
#define _DAC2REFL_REF5_LENGTH                               0x1
#define _DAC2REFL_REF5_MASK                                 0x20
#define _DAC2REFL_REF6_POSN                                 0x6
#define _DAC2REFL_REF6_POSITION                             0x6
#define _DAC2REFL_REF6_SIZE                                 0x1
#define _DAC2REFL_REF6_LENGTH                               0x1
#define _DAC2REFL_REF6_MASK                                 0x40
#define _DAC2REFL_REF7_POSN                                 0x7
#define _DAC2REFL_REF7_POSITION                             0x7
#define _DAC2REFL_REF7_SIZE                                 0x1
#define _DAC2REFL_REF7_LENGTH                               0x1
#define _DAC2REFL_REF7_MASK                                 0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned REF                    :8;
    };
    struct {
        unsigned DAC2REF0               :1;
        unsigned DAC2REF1               :1;
        unsigned DAC2REF2               :1;
        unsigned DAC2REF3               :1;
        unsigned DAC2REF4               :1;
        unsigned DAC2REF5               :1;
        unsigned DAC2REF6               :1;
        unsigned DAC2REF7               :1;
    };
    struct {
        unsigned R0                     :1;
        unsigned R1                     :1;
        unsigned R2                     :1;
        unsigned R3                     :1;
        unsigned R4                     :1;
        unsigned R5                     :1;
        unsigned R6                     :1;
        unsigned R7                     :1;
    };
    struct {
        unsigned DAC2R0                 :1;
        unsigned DAC2R1                 :1;
        unsigned DAC2R2                 :1;
        unsigned DAC2R3                 :1;
        unsigned DAC2R4                 :1;
        unsigned DAC2R5                 :1;
        unsigned DAC2R6                 :1;
        unsigned DAC2R7                 :1;
    };
    struct {
        unsigned REF0                   :1;
        unsigned REF1                   :1;
        unsigned REF2                   :1;
        unsigned REF3                   :1;
        unsigned REF4                   :1;
        unsigned REF5                   :1;
        unsigned REF6                   :1;
        unsigned REF7                   :1;
    };
} DAC2CON1bits_t;
