MikroElektronika/core_packages/PIC/XC8/def/PIC16F1776/mcu.h
extern volatile DAC4CON0bits_t DAC4CON0bits __at(0x596);
// bitfield macros
#define _DAC4CON0_NSS_POSN                                  0x0
#define _DAC4CON0_NSS_POSITION                              0x0
#define _DAC4CON0_NSS_SIZE                                  0x2
#define _DAC4CON0_NSS_LENGTH                                0x2
#define _DAC4CON0_NSS_MASK                                  0x3
#define _DAC4CON0_PSS_POSN                                  0x2
#define _DAC4CON0_PSS_POSITION                              0x2
#define _DAC4CON0_PSS_SIZE                                  0x2
#define _DAC4CON0_PSS_LENGTH                                0x2
#define _DAC4CON0_PSS_MASK                                  0xC
#define _DAC4CON0_OE2_POSN                                  0x4
#define _DAC4CON0_OE2_POSITION                              0x4
#define _DAC4CON0_OE2_SIZE                                  0x1
#define _DAC4CON0_OE2_LENGTH                                0x1
#define _DAC4CON0_OE2_MASK                                  0x10
#define _DAC4CON0_OE1_POSN                                  0x5
#define _DAC4CON0_OE1_POSITION                              0x5
#define _DAC4CON0_OE1_SIZE                                  0x1
#define _DAC4CON0_OE1_LENGTH                                0x1
#define _DAC4CON0_OE1_MASK                                  0x20
#define _DAC4CON0_EN_POSN                                   0x7
#define _DAC4CON0_EN_POSITION                               0x7
#define _DAC4CON0_EN_SIZE                                   0x1
#define _DAC4CON0_EN_LENGTH                                 0x1
#define _DAC4CON0_EN_MASK                                   0x80
#define _DAC4CON0_NSS0_POSN                                 0x0
#define _DAC4CON0_NSS0_POSITION                             0x0
#define _DAC4CON0_NSS0_SIZE                                 0x1
#define _DAC4CON0_NSS0_LENGTH                               0x1
#define _DAC4CON0_NSS0_MASK                                 0x1
#define _DAC4CON0_NSS1_POSN                                 0x1
#define _DAC4CON0_NSS1_POSITION                             0x1
#define _DAC4CON0_NSS1_SIZE                                 0x1
#define _DAC4CON0_NSS1_LENGTH                               0x1
#define _DAC4CON0_NSS1_MASK                                 0x2
#define _DAC4CON0_PSS0_POSN                                 0x2
#define _DAC4CON0_PSS0_POSITION                             0x2
#define _DAC4CON0_PSS0_SIZE                                 0x1
#define _DAC4CON0_PSS0_LENGTH                               0x1
#define _DAC4CON0_PSS0_MASK                                 0x4
#define _DAC4CON0_PSS1_POSN                                 0x3
#define _DAC4CON0_PSS1_POSITION                             0x3
#define _DAC4CON0_PSS1_SIZE                                 0x1
#define _DAC4CON0_PSS1_LENGTH                               0x1
#define _DAC4CON0_PSS1_MASK                                 0x8
#define _DAC4CON0_DACNSS_POSN                               0x0
#define _DAC4CON0_DACNSS_POSITION                           0x0
#define _DAC4CON0_DACNSS_SIZE                               0x2
#define _DAC4CON0_DACNSS_LENGTH                             0x2
#define _DAC4CON0_DACNSS_MASK                               0x3
#define _DAC4CON0_DACPSS_POSN                               0x2
#define _DAC4CON0_DACPSS_POSITION                           0x2
#define _DAC4CON0_DACPSS_SIZE                               0x2
#define _DAC4CON0_DACPSS_LENGTH                             0x2
#define _DAC4CON0_DACPSS_MASK                               0xC
#define _DAC4CON0_DACOE2_POSN                               0x4
#define _DAC4CON0_DACOE2_POSITION                           0x4
#define _DAC4CON0_DACOE2_SIZE                               0x1
#define _DAC4CON0_DACOE2_LENGTH                             0x1
#define _DAC4CON0_DACOE2_MASK                               0x10
#define _DAC4CON0_DACOE1_POSN                               0x5
#define _DAC4CON0_DACOE1_POSITION                           0x5
#define _DAC4CON0_DACOE1_SIZE                               0x1
#define _DAC4CON0_DACOE1_LENGTH                             0x1
#define _DAC4CON0_DACOE1_MASK                               0x20
#define _DAC4CON0_DACEN_POSN                                0x7
#define _DAC4CON0_DACEN_POSITION                            0x7
#define _DAC4CON0_DACEN_SIZE                                0x1
#define _DAC4CON0_DACEN_LENGTH                              0x1
#define _DAC4CON0_DACEN_MASK                                0x80
#define _DAC4CON0_DACNSS0_POSN                              0x0
#define _DAC4CON0_DACNSS0_POSITION                          0x0
#define _DAC4CON0_DACNSS0_SIZE                              0x1
#define _DAC4CON0_DACNSS0_LENGTH                            0x1
#define _DAC4CON0_DACNSS0_MASK                              0x1
#define _DAC4CON0_DACNSS1_POSN                              0x1
#define _DAC4CON0_DACNSS1_POSITION                          0x1
#define _DAC4CON0_DACNSS1_SIZE                              0x1
#define _DAC4CON0_DACNSS1_LENGTH                            0x1
#define _DAC4CON0_DACNSS1_MASK                              0x2
#define _DAC4CON0_DACPSS0_POSN                              0x2
#define _DAC4CON0_DACPSS0_POSITION                          0x2
#define _DAC4CON0_DACPSS0_SIZE                              0x1
#define _DAC4CON0_DACPSS0_LENGTH                            0x1
#define _DAC4CON0_DACPSS0_MASK                              0x4
#define _DAC4CON0_DACPSS1_POSN                              0x3
#define _DAC4CON0_DACPSS1_POSITION                          0x3
#define _DAC4CON0_DACPSS1_SIZE                              0x1
#define _DAC4CON0_DACPSS1_LENGTH                            0x1
#define _DAC4CON0_DACPSS1_MASK                              0x8
#define _DAC4CON0_DAC4NSS_POSN                              0x0
#define _DAC4CON0_DAC4NSS_POSITION                          0x0
#define _DAC4CON0_DAC4NSS_SIZE                              0x2
#define _DAC4CON0_DAC4NSS_LENGTH                            0x2
#define _DAC4CON0_DAC4NSS_MASK                              0x3
#define _DAC4CON0_DAC4PSS_POSN                              0x2
#define _DAC4CON0_DAC4PSS_POSITION                          0x2
#define _DAC4CON0_DAC4PSS_SIZE                              0x2
#define _DAC4CON0_DAC4PSS_LENGTH                            0x2
#define _DAC4CON0_DAC4PSS_MASK                              0xC
#define _DAC4CON0_DAC4OE2_POSN                              0x4
#define _DAC4CON0_DAC4OE2_POSITION                          0x4
#define _DAC4CON0_DAC4OE2_SIZE                              0x1
#define _DAC4CON0_DAC4OE2_LENGTH                            0x1
#define _DAC4CON0_DAC4OE2_MASK                              0x10
#define _DAC4CON0_DAC4OE1_POSN                              0x5
#define _DAC4CON0_DAC4OE1_POSITION                          0x5
#define _DAC4CON0_DAC4OE1_SIZE                              0x1
#define _DAC4CON0_DAC4OE1_LENGTH                            0x1
#define _DAC4CON0_DAC4OE1_MASK                              0x20
#define _DAC4CON0_DAC4EN_POSN                               0x7
#define _DAC4CON0_DAC4EN_POSITION                           0x7
#define _DAC4CON0_DAC4EN_SIZE                               0x1
#define _DAC4CON0_DAC4EN_LENGTH                             0x1
#define _DAC4CON0_DAC4EN_MASK                               0x80
#define _DAC4CON0_DAC4NSS0_POSN                             0x0
#define _DAC4CON0_DAC4NSS0_POSITION                         0x0
#define _DAC4CON0_DAC4NSS0_SIZE                             0x1
#define _DAC4CON0_DAC4NSS0_LENGTH                           0x1
#define _DAC4CON0_DAC4NSS0_MASK                             0x1
#define _DAC4CON0_DAC4NSS1_POSN                             0x1
#define _DAC4CON0_DAC4NSS1_POSITION                         0x1
#define _DAC4CON0_DAC4NSS1_SIZE                             0x1
#define _DAC4CON0_DAC4NSS1_LENGTH                           0x1
#define _DAC4CON0_DAC4NSS1_MASK                             0x2
#define _DAC4CON0_DAC4PSS0_POSN                             0x2
#define _DAC4CON0_DAC4PSS0_POSITION                         0x2
#define _DAC4CON0_DAC4PSS0_SIZE                             0x1
#define _DAC4CON0_DAC4PSS0_LENGTH                           0x1
#define _DAC4CON0_DAC4PSS0_MASK                             0x4
#define _DAC4CON0_DAC4PSS1_POSN                             0x3
#define _DAC4CON0_DAC4PSS1_POSITION                         0x3
#define _DAC4CON0_DAC4PSS1_SIZE                             0x1
#define _DAC4CON0_DAC4PSS1_LENGTH                           0x1
#define _DAC4CON0_DAC4PSS1_MASK                             0x8

// Register: DAC4REF
#define DAC4REF DAC4REF
extern volatile unsigned char           DAC4REF             __at(0x597);
#ifndef _LIB_BUILD
asm("DAC4REF equ 0597h");
#endif
// aliases
extern volatile unsigned char           DAC4CON1            __at(0x597);
#ifndef _LIB_BUILD
asm("DAC4CON1 equ 0597h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DACR                   :5;
    };
    struct {
        unsigned DACR0                  :1;
        unsigned DACR1                  :1;
        unsigned DACR2                  :1;
        unsigned DACR3                  :1;
        unsigned DACR4                  :1;
    };
    struct {
        unsigned R0                     :1;
        unsigned R1                     :1;
        unsigned R2                     :1;
        unsigned R3                     :1;
        unsigned R4                     :1;
    };
    struct {
        unsigned DAC4R                  :5;
    };
    struct {
        unsigned DAC4R0                 :1;
        unsigned DAC4R1                 :1;
        unsigned DAC4R2                 :1;
        unsigned DAC4R3                 :1;
        unsigned DAC4R4                 :1;
    };
    struct {
        unsigned REF0                   :1;
        unsigned REF1                   :1;
        unsigned REF2                   :1;
        unsigned REF3                   :1;
        unsigned REF4                   :1;
    };
    struct {
        unsigned DAC4REF0               :1;
        unsigned DAC4REF1               :1;
        unsigned DAC4REF2               :1;
        unsigned DAC4REF3               :1;
        unsigned DAC4REF4               :1;
    };
} DAC4REFbits_t;
extern volatile DAC4REFbits_t DAC4REFbits __at(0x597);
// bitfield macros
#define _DAC4REF_DACR_POSN                                  0x0
#define _DAC4REF_DACR_POSITION                              0x0
#define _DAC4REF_DACR_SIZE                                  0x5
#define _DAC4REF_DACR_LENGTH                                0x5
#define _DAC4REF_DACR_MASK                                  0x1F
#define _DAC4REF_DACR0_POSN                                 0x0
#define _DAC4REF_DACR0_POSITION                             0x0
#define _DAC4REF_DACR0_SIZE                                 0x1
#define _DAC4REF_DACR0_LENGTH                               0x1
#define _DAC4REF_DACR0_MASK                                 0x1
#define _DAC4REF_DACR1_POSN                                 0x1
#define _DAC4REF_DACR1_POSITION                             0x1
#define _DAC4REF_DACR1_SIZE                                 0x1
#define _DAC4REF_DACR1_LENGTH                               0x1
#define _DAC4REF_DACR1_MASK                                 0x2
#define _DAC4REF_DACR2_POSN                                 0x2
#define _DAC4REF_DACR2_POSITION                             0x2
#define _DAC4REF_DACR2_SIZE                                 0x1
#define _DAC4REF_DACR2_LENGTH                               0x1
#define _DAC4REF_DACR2_MASK                                 0x4
#define _DAC4REF_DACR3_POSN                                 0x3
#define _DAC4REF_DACR3_POSITION                             0x3
#define _DAC4REF_DACR3_SIZE                                 0x1
#define _DAC4REF_DACR3_LENGTH                               0x1
#define _DAC4REF_DACR3_MASK                                 0x8
#define _DAC4REF_DACR4_POSN                                 0x4
#define _DAC4REF_DACR4_POSITION                             0x4
#define _DAC4REF_DACR4_SIZE                                 0x1
#define _DAC4REF_DACR4_LENGTH                               0x1
#define _DAC4REF_DACR4_MASK                                 0x10
#define _DAC4REF_R0_POSN                                    0x0
#define _DAC4REF_R0_POSITION                                0x0
#define _DAC4REF_R0_SIZE                                    0x1
#define _DAC4REF_R0_LENGTH                                  0x1
#define _DAC4REF_R0_MASK                                    0x1
#define _DAC4REF_R1_POSN                                    0x1
#define _DAC4REF_R1_POSITION                                0x1
#define _DAC4REF_R1_SIZE                                    0x1
#define _DAC4REF_R1_LENGTH                                  0x1
#define _DAC4REF_R1_MASK                                    0x2
#define _DAC4REF_R2_POSN                                    0x2
#define _DAC4REF_R2_POSITION                                0x2
#define _DAC4REF_R2_SIZE                                    0x1
#define _DAC4REF_R2_LENGTH                                  0x1
#define _DAC4REF_R2_MASK                                    0x4
#define _DAC4REF_R3_POSN                                    0x3
#define _DAC4REF_R3_POSITION                                0x3
#define _DAC4REF_R3_SIZE                                    0x1
#define _DAC4REF_R3_LENGTH                                  0x1
#define _DAC4REF_R3_MASK                                    0x8
#define _DAC4REF_R4_POSN                                    0x4
#define _DAC4REF_R4_POSITION                                0x4
#define _DAC4REF_R4_SIZE                                    0x1
#define _DAC4REF_R4_LENGTH                                  0x1
#define _DAC4REF_R4_MASK                                    0x10
#define _DAC4REF_DAC4R_POSN                                 0x0
#define _DAC4REF_DAC4R_POSITION                             0x0
#define _DAC4REF_DAC4R_SIZE                                 0x5
#define _DAC4REF_DAC4R_LENGTH                               0x5
#define _DAC4REF_DAC4R_MASK                                 0x1F
#define _DAC4REF_DAC4R0_POSN                                0x0
#define _DAC4REF_DAC4R0_POSITION                            0x0
#define _DAC4REF_DAC4R0_SIZE                                0x1
#define _DAC4REF_DAC4R0_LENGTH                              0x1
#define _DAC4REF_DAC4R0_MASK                                0x1
#define _DAC4REF_DAC4R1_POSN                                0x1
#define _DAC4REF_DAC4R1_POSITION                            0x1
#define _DAC4REF_DAC4R1_SIZE                                0x1
#define _DAC4REF_DAC4R1_LENGTH                              0x1
#define _DAC4REF_DAC4R1_MASK                                0x2
#define _DAC4REF_DAC4R2_POSN                                0x2
#define _DAC4REF_DAC4R2_POSITION                            0x2
#define _DAC4REF_DAC4R2_SIZE                                0x1
#define _DAC4REF_DAC4R2_LENGTH                              0x1
#define _DAC4REF_DAC4R2_MASK                                0x4
#define _DAC4REF_DAC4R3_POSN                                0x3
#define _DAC4REF_DAC4R3_POSITION                            0x3
#define _DAC4REF_DAC4R3_SIZE                                0x1
#define _DAC4REF_DAC4R3_LENGTH                              0x1
#define _DAC4REF_DAC4R3_MASK                                0x8
#define _DAC4REF_DAC4R4_POSN                                0x4
#define _DAC4REF_DAC4R4_POSITION                            0x4
#define _DAC4REF_DAC4R4_SIZE                                0x1
#define _DAC4REF_DAC4R4_LENGTH                              0x1
#define _DAC4REF_DAC4R4_MASK                                0x10
#define _DAC4REF_REF0_POSN                                  0x0
#define _DAC4REF_REF0_POSITION                              0x0
#define _DAC4REF_REF0_SIZE                                  0x1
#define _DAC4REF_REF0_LENGTH                                0x1
#define _DAC4REF_REF0_MASK                                  0x1
#define _DAC4REF_REF1_POSN                                  0x1
#define _DAC4REF_REF1_POSITION                              0x1
#define _DAC4REF_REF1_SIZE                                  0x1
#define _DAC4REF_REF1_LENGTH                                0x1
#define _DAC4REF_REF1_MASK                                  0x2
#define _DAC4REF_REF2_POSN                                  0x2
#define _DAC4REF_REF2_POSITION                              0x2
#define _DAC4REF_REF2_SIZE                                  0x1
#define _DAC4REF_REF2_LENGTH                                0x1
#define _DAC4REF_REF2_MASK                                  0x4
#define _DAC4REF_REF3_POSN                                  0x3
#define _DAC4REF_REF3_POSITION                              0x3
#define _DAC4REF_REF3_SIZE                                  0x1
#define _DAC4REF_REF3_LENGTH                                0x1
#define _DAC4REF_REF3_MASK                                  0x8
#define _DAC4REF_REF4_POSN                                  0x4
#define _DAC4REF_REF4_POSITION                              0x4
#define _DAC4REF_REF4_SIZE                                  0x1
#define _DAC4REF_REF4_LENGTH                                0x1
#define _DAC4REF_REF4_MASK                                  0x10
#define _DAC4REF_DAC4REF0_POSN                              0x0
#define _DAC4REF_DAC4REF0_POSITION                          0x0
#define _DAC4REF_DAC4REF0_SIZE                              0x1
#define _DAC4REF_DAC4REF0_LENGTH                            0x1
#define _DAC4REF_DAC4REF0_MASK                              0x1
#define _DAC4REF_DAC4REF1_POSN                              0x1
#define _DAC4REF_DAC4REF1_POSITION                          0x1
#define _DAC4REF_DAC4REF1_SIZE                              0x1
#define _DAC4REF_DAC4REF1_LENGTH                            0x1
#define _DAC4REF_DAC4REF1_MASK                              0x2
#define _DAC4REF_DAC4REF2_POSN                              0x2
#define _DAC4REF_DAC4REF2_POSITION                          0x2
#define _DAC4REF_DAC4REF2_SIZE                              0x1
#define _DAC4REF_DAC4REF2_LENGTH                            0x1
#define _DAC4REF_DAC4REF2_MASK                              0x4
#define _DAC4REF_DAC4REF3_POSN                              0x3
#define _DAC4REF_DAC4REF3_POSITION                          0x3
#define _DAC4REF_DAC4REF3_SIZE                              0x1
#define _DAC4REF_DAC4REF3_LENGTH                            0x1
#define _DAC4REF_DAC4REF3_MASK                              0x8
#define _DAC4REF_DAC4REF4_POSN                              0x4
#define _DAC4REF_DAC4REF4_POSITION                          0x4
#define _DAC4REF_DAC4REF4_SIZE                              0x1
#define _DAC4REF_DAC4REF4_LENGTH                            0x1
#define _DAC4REF_DAC4REF4_MASK                              0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned DACR                   :5;
    };
    struct {
        unsigned DACR0                  :1;
        unsigned DACR1                  :1;
        unsigned DACR2                  :1;
        unsigned DACR3                  :1;
        unsigned DACR4                  :1;
    };
    struct {
        unsigned R0                     :1;
        unsigned R1                     :1;
        unsigned R2                     :1;
        unsigned R3                     :1;
        unsigned R4                     :1;
    };
    struct {
        unsigned DAC4R                  :5;
    };
    struct {
        unsigned DAC4R0                 :1;
        unsigned DAC4R1                 :1;
        unsigned DAC4R2                 :1;
        unsigned DAC4R3                 :1;
        unsigned DAC4R4                 :1;
    };
    struct {
        unsigned REF0                   :1;
        unsigned REF1                   :1;
        unsigned REF2                   :1;
        unsigned REF3                   :1;
        unsigned REF4                   :1;
    };
    struct {
        unsigned DAC4REF0               :1;
        unsigned DAC4REF1               :1;
        unsigned DAC4REF2               :1;
        unsigned DAC4REF3               :1;
        unsigned DAC4REF4               :1;
    };
} DAC4CON1bits_t;
