MikroElektronika/core_packages/PIC/XC8/def/PIC16F1776/mcu.h
extern volatile COG3ASD0bits_t COG3ASD0bits __at(0x81D);
// bitfield macros
#define _COG3ASD0_ASDAC_POSN                                0x2
#define _COG3ASD0_ASDAC_POSITION                            0x2
#define _COG3ASD0_ASDAC_SIZE                                0x2
#define _COG3ASD0_ASDAC_LENGTH                              0x2
#define _COG3ASD0_ASDAC_MASK                                0xC
#define _COG3ASD0_ASDBD_POSN                                0x4
#define _COG3ASD0_ASDBD_POSITION                            0x4
#define _COG3ASD0_ASDBD_SIZE                                0x2
#define _COG3ASD0_ASDBD_LENGTH                              0x2
#define _COG3ASD0_ASDBD_MASK                                0x30
#define _COG3ASD0_ASREN_POSN                                0x6
#define _COG3ASD0_ASREN_POSITION                            0x6
#define _COG3ASD0_ASREN_SIZE                                0x1
#define _COG3ASD0_ASREN_LENGTH                              0x1
#define _COG3ASD0_ASREN_MASK                                0x40
#define _COG3ASD0_ASE_POSN                                  0x7
#define _COG3ASD0_ASE_POSITION                              0x7
#define _COG3ASD0_ASE_SIZE                                  0x1
#define _COG3ASD0_ASE_LENGTH                                0x1
#define _COG3ASD0_ASE_MASK                                  0x80
#define _COG3ASD0_ASDAC0_POSN                               0x2
#define _COG3ASD0_ASDAC0_POSITION                           0x2
#define _COG3ASD0_ASDAC0_SIZE                               0x1
#define _COG3ASD0_ASDAC0_LENGTH                             0x1
#define _COG3ASD0_ASDAC0_MASK                               0x4
#define _COG3ASD0_ASDAC1_POSN                               0x3
#define _COG3ASD0_ASDAC1_POSITION                           0x3
#define _COG3ASD0_ASDAC1_SIZE                               0x1
#define _COG3ASD0_ASDAC1_LENGTH                             0x1
#define _COG3ASD0_ASDAC1_MASK                               0x8
#define _COG3ASD0_ASDBD0_POSN                               0x4
#define _COG3ASD0_ASDBD0_POSITION                           0x4
#define _COG3ASD0_ASDBD0_SIZE                               0x1
#define _COG3ASD0_ASDBD0_LENGTH                             0x1
#define _COG3ASD0_ASDBD0_MASK                               0x10
#define _COG3ASD0_ASDBD1_POSN                               0x5
#define _COG3ASD0_ASDBD1_POSITION                           0x5
#define _COG3ASD0_ASDBD1_SIZE                               0x1
#define _COG3ASD0_ASDBD1_LENGTH                             0x1
#define _COG3ASD0_ASDBD1_MASK                               0x20
#define _COG3ASD0_ARSEN_POSN                                0x6
#define _COG3ASD0_ARSEN_POSITION                            0x6
#define _COG3ASD0_ARSEN_SIZE                                0x1
#define _COG3ASD0_ARSEN_LENGTH                              0x1
#define _COG3ASD0_ARSEN_MASK                                0x40
#define _COG3ASD0_G3ASDAC_POSN                              0x2
#define _COG3ASD0_G3ASDAC_POSITION                          0x2
#define _COG3ASD0_G3ASDAC_SIZE                              0x2
#define _COG3ASD0_G3ASDAC_LENGTH                            0x2
#define _COG3ASD0_G3ASDAC_MASK                              0xC
#define _COG3ASD0_G3ASDBD_POSN                              0x4
#define _COG3ASD0_G3ASDBD_POSITION                          0x4
#define _COG3ASD0_G3ASDBD_SIZE                              0x2
#define _COG3ASD0_G3ASDBD_LENGTH                            0x2
#define _COG3ASD0_G3ASDBD_MASK                              0x30
#define _COG3ASD0_G3ARSEN_POSN                              0x6
#define _COG3ASD0_G3ARSEN_POSITION                          0x6
#define _COG3ASD0_G3ARSEN_SIZE                              0x1
#define _COG3ASD0_G3ARSEN_LENGTH                            0x1
#define _COG3ASD0_G3ARSEN_MASK                              0x40
#define _COG3ASD0_G3ASE_POSN                                0x7
#define _COG3ASD0_G3ASE_POSITION                            0x7
#define _COG3ASD0_G3ASE_SIZE                                0x1
#define _COG3ASD0_G3ASE_LENGTH                              0x1
#define _COG3ASD0_G3ASE_MASK                                0x80
#define _COG3ASD0_G3ASDAC0_POSN                             0x2
#define _COG3ASD0_G3ASDAC0_POSITION                         0x2
#define _COG3ASD0_G3ASDAC0_SIZE                             0x1
#define _COG3ASD0_G3ASDAC0_LENGTH                           0x1
#define _COG3ASD0_G3ASDAC0_MASK                             0x4
#define _COG3ASD0_G3ASDAC1_POSN                             0x3
#define _COG3ASD0_G3ASDAC1_POSITION                         0x3
#define _COG3ASD0_G3ASDAC1_SIZE                             0x1
#define _COG3ASD0_G3ASDAC1_LENGTH                           0x1
#define _COG3ASD0_G3ASDAC1_MASK                             0x8
#define _COG3ASD0_G3ASDBD0_POSN                             0x4
#define _COG3ASD0_G3ASDBD0_POSITION                         0x4
#define _COG3ASD0_G3ASDBD0_SIZE                             0x1
#define _COG3ASD0_G3ASDBD0_LENGTH                           0x1
#define _COG3ASD0_G3ASDBD0_MASK                             0x10
#define _COG3ASD0_G3ASDBD1_POSN                             0x5
#define _COG3ASD0_G3ASDBD1_POSITION                         0x5
#define _COG3ASD0_G3ASDBD1_SIZE                             0x1
#define _COG3ASD0_G3ASDBD1_LENGTH                           0x1
#define _COG3ASD0_G3ASDBD1_MASK                             0x20
#define _COG3ASD0_G3ASREN_POSN                              0x6
#define _COG3ASD0_G3ASREN_POSITION                          0x6
#define _COG3ASD0_G3ASREN_SIZE                              0x1
#define _COG3ASD0_G3ASREN_LENGTH                            0x1
#define _COG3ASD0_G3ASREN_MASK                              0x40

// Register: COG3ASD1
#define COG3ASD1 COG3ASD1
extern volatile unsigned char           COG3ASD1            __at(0x81E);
#ifndef _LIB_BUILD
asm("COG3ASD1 equ 081Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AS0E                   :1;
        unsigned AS1E                   :1;
        unsigned AS2E                   :1;
        unsigned AS3E                   :1;
        unsigned AS4E                   :1;
        unsigned AS5E                   :1;
        unsigned AS6E                   :1;
        unsigned AS7E                   :1;
    };
    struct {
        unsigned G3AS0E                 :1;
        unsigned G3AS1E                 :1;
        unsigned G3AS2E                 :1;
        unsigned G3AS3E                 :1;
        unsigned G3AS4E                 :1;
        unsigned G3AS5E                 :1;
        unsigned G3AS6E                 :1;
        unsigned G3AS7E                 :1;
    };
} COG3ASD1bits_t;
extern volatile COG3ASD1bits_t COG3ASD1bits __at(0x81E);
// bitfield macros
#define _COG3ASD1_AS0E_POSN                                 0x0
#define _COG3ASD1_AS0E_POSITION                             0x0
#define _COG3ASD1_AS0E_SIZE                                 0x1
#define _COG3ASD1_AS0E_LENGTH                               0x1
#define _COG3ASD1_AS0E_MASK                                 0x1
#define _COG3ASD1_AS1E_POSN                                 0x1
#define _COG3ASD1_AS1E_POSITION                             0x1
#define _COG3ASD1_AS1E_SIZE                                 0x1
#define _COG3ASD1_AS1E_LENGTH                               0x1
#define _COG3ASD1_AS1E_MASK                                 0x2
#define _COG3ASD1_AS2E_POSN                                 0x2
#define _COG3ASD1_AS2E_POSITION                             0x2
#define _COG3ASD1_AS2E_SIZE                                 0x1
#define _COG3ASD1_AS2E_LENGTH                               0x1
#define _COG3ASD1_AS2E_MASK                                 0x4
#define _COG3ASD1_AS3E_POSN                                 0x3
#define _COG3ASD1_AS3E_POSITION                             0x3
#define _COG3ASD1_AS3E_SIZE                                 0x1
#define _COG3ASD1_AS3E_LENGTH                               0x1
#define _COG3ASD1_AS3E_MASK                                 0x8
#define _COG3ASD1_AS4E_POSN                                 0x4
#define _COG3ASD1_AS4E_POSITION                             0x4
#define _COG3ASD1_AS4E_SIZE                                 0x1
#define _COG3ASD1_AS4E_LENGTH                               0x1
#define _COG3ASD1_AS4E_MASK                                 0x10
#define _COG3ASD1_AS5E_POSN                                 0x5
#define _COG3ASD1_AS5E_POSITION                             0x5
#define _COG3ASD1_AS5E_SIZE                                 0x1
#define _COG3ASD1_AS5E_LENGTH                               0x1
#define _COG3ASD1_AS5E_MASK                                 0x20
#define _COG3ASD1_AS6E_POSN                                 0x6
#define _COG3ASD1_AS6E_POSITION                             0x6
#define _COG3ASD1_AS6E_SIZE                                 0x1
#define _COG3ASD1_AS6E_LENGTH                               0x1
#define _COG3ASD1_AS6E_MASK                                 0x40
#define _COG3ASD1_AS7E_POSN                                 0x7
#define _COG3ASD1_AS7E_POSITION                             0x7
#define _COG3ASD1_AS7E_SIZE                                 0x1
#define _COG3ASD1_AS7E_LENGTH                               0x1
#define _COG3ASD1_AS7E_MASK                                 0x80
#define _COG3ASD1_G3AS0E_POSN                               0x0
#define _COG3ASD1_G3AS0E_POSITION                           0x0
#define _COG3ASD1_G3AS0E_SIZE                               0x1
#define _COG3ASD1_G3AS0E_LENGTH                             0x1
#define _COG3ASD1_G3AS0E_MASK                               0x1
#define _COG3ASD1_G3AS1E_POSN                               0x1
#define _COG3ASD1_G3AS1E_POSITION                           0x1
#define _COG3ASD1_G3AS1E_SIZE                               0x1
#define _COG3ASD1_G3AS1E_LENGTH                             0x1
#define _COG3ASD1_G3AS1E_MASK                               0x2
#define _COG3ASD1_G3AS2E_POSN                               0x2
#define _COG3ASD1_G3AS2E_POSITION                           0x2
#define _COG3ASD1_G3AS2E_SIZE                               0x1
#define _COG3ASD1_G3AS2E_LENGTH                             0x1
#define _COG3ASD1_G3AS2E_MASK                               0x4
#define _COG3ASD1_G3AS3E_POSN                               0x3
#define _COG3ASD1_G3AS3E_POSITION                           0x3
#define _COG3ASD1_G3AS3E_SIZE                               0x1
#define _COG3ASD1_G3AS3E_LENGTH                             0x1
#define _COG3ASD1_G3AS3E_MASK                               0x8
#define _COG3ASD1_G3AS4E_POSN                               0x4
#define _COG3ASD1_G3AS4E_POSITION                           0x4
#define _COG3ASD1_G3AS4E_SIZE                               0x1
#define _COG3ASD1_G3AS4E_LENGTH                             0x1
#define _COG3ASD1_G3AS4E_MASK                               0x10
#define _COG3ASD1_G3AS5E_POSN                               0x5
#define _COG3ASD1_G3AS5E_POSITION                           0x5
#define _COG3ASD1_G3AS5E_SIZE                               0x1
#define _COG3ASD1_G3AS5E_LENGTH                             0x1
#define _COG3ASD1_G3AS5E_MASK                               0x20
#define _COG3ASD1_G3AS6E_POSN                               0x6
#define _COG3ASD1_G3AS6E_POSITION                           0x6
#define _COG3ASD1_G3AS6E_SIZE                               0x1
#define _COG3ASD1_G3AS6E_LENGTH                             0x1
#define _COG3ASD1_G3AS6E_MASK                               0x40
#define _COG3ASD1_G3AS7E_POSN                               0x7
#define _COG3ASD1_G3AS7E_POSITION                           0x7
#define _COG3ASD1_G3AS7E_SIZE                               0x1
#define _COG3ASD1_G3AS7E_LENGTH                             0x1
#define _COG3ASD1_G3AS7E_MASK                               0x80

