MikroElektronika/core_packages/PIC/XC8/def/PIC16F1776/mcu.h
extern volatile CM5CON0bits_t CM5CON0bits __at(0x910);
// bitfield macros
#define _CM5CON0_SYNC_POSN                                  0x0
#define _CM5CON0_SYNC_POSITION                              0x0
#define _CM5CON0_SYNC_SIZE                                  0x1
#define _CM5CON0_SYNC_LENGTH                                0x1
#define _CM5CON0_SYNC_MASK                                  0x1
#define _CM5CON0_HYS_POSN                                   0x1
#define _CM5CON0_HYS_POSITION                               0x1
#define _CM5CON0_HYS_SIZE                                   0x1
#define _CM5CON0_HYS_LENGTH                                 0x1
#define _CM5CON0_HYS_MASK                                   0x2
#define _CM5CON0_ZLF_POSN                                   0x3
#define _CM5CON0_ZLF_POSITION                               0x3
#define _CM5CON0_ZLF_SIZE                                   0x1
#define _CM5CON0_ZLF_LENGTH                                 0x1
#define _CM5CON0_ZLF_MASK                                   0x8
#define _CM5CON0_POL_POSN                                   0x4
#define _CM5CON0_POL_POSITION                               0x4
#define _CM5CON0_POL_SIZE                                   0x1
#define _CM5CON0_POL_LENGTH                                 0x1
#define _CM5CON0_POL_MASK                                   0x10
#define _CM5CON0_OUT_POSN                                   0x6
#define _CM5CON0_OUT_POSITION                               0x6
#define _CM5CON0_OUT_SIZE                                   0x1
#define _CM5CON0_OUT_LENGTH                                 0x1
#define _CM5CON0_OUT_MASK                                   0x40
#define _CM5CON0_ON_POSN                                    0x7
#define _CM5CON0_ON_POSITION                                0x7
#define _CM5CON0_ON_SIZE                                    0x1
#define _CM5CON0_ON_LENGTH                                  0x1
#define _CM5CON0_ON_MASK                                    0x80
#define _CM5CON0_C5SYNC_POSN                                0x0
#define _CM5CON0_C5SYNC_POSITION                            0x0
#define _CM5CON0_C5SYNC_SIZE                                0x1
#define _CM5CON0_C5SYNC_LENGTH                              0x1
#define _CM5CON0_C5SYNC_MASK                                0x1
#define _CM5CON0_C5HYS_POSN                                 0x1
#define _CM5CON0_C5HYS_POSITION                             0x1
#define _CM5CON0_C5HYS_SIZE                                 0x1
#define _CM5CON0_C5HYS_LENGTH                               0x1
#define _CM5CON0_C5HYS_MASK                                 0x2
#define _CM5CON0_C5ZLF_POSN                                 0x3
#define _CM5CON0_C5ZLF_POSITION                             0x3
#define _CM5CON0_C5ZLF_SIZE                                 0x1
#define _CM5CON0_C5ZLF_LENGTH                               0x1
#define _CM5CON0_C5ZLF_MASK                                 0x8
#define _CM5CON0_C5POL_POSN                                 0x4
#define _CM5CON0_C5POL_POSITION                             0x4
#define _CM5CON0_C5POL_SIZE                                 0x1
#define _CM5CON0_C5POL_LENGTH                               0x1
#define _CM5CON0_C5POL_MASK                                 0x10
#define _CM5CON0_C5OUT_POSN                                 0x6
#define _CM5CON0_C5OUT_POSITION                             0x6
#define _CM5CON0_C5OUT_SIZE                                 0x1
#define _CM5CON0_C5OUT_LENGTH                               0x1
#define _CM5CON0_C5OUT_MASK                                 0x40
#define _CM5CON0_C5ON_POSN                                  0x7
#define _CM5CON0_C5ON_POSITION                              0x7
#define _CM5CON0_C5ON_SIZE                                  0x1
#define _CM5CON0_C5ON_LENGTH                                0x1
#define _CM5CON0_C5ON_MASK                                  0x80

// Register: CM5CON1
#define CM5CON1 CM5CON1
extern volatile unsigned char           CM5CON1             __at(0x911);
#ifndef _LIB_BUILD
asm("CM5CON1 equ 0911h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTN                   :1;
        unsigned INTP                   :1;
    };
    struct {
        unsigned C5INTN                 :1;
        unsigned C5INTP                 :1;
    };
} CM5CON1bits_t;
extern volatile CM5CON1bits_t CM5CON1bits __at(0x911);
// bitfield macros
#define _CM5CON1_INTN_POSN                                  0x0
#define _CM5CON1_INTN_POSITION                              0x0
#define _CM5CON1_INTN_SIZE                                  0x1
#define _CM5CON1_INTN_LENGTH                                0x1
#define _CM5CON1_INTN_MASK                                  0x1
#define _CM5CON1_INTP_POSN                                  0x1
#define _CM5CON1_INTP_POSITION                              0x1
#define _CM5CON1_INTP_SIZE                                  0x1
#define _CM5CON1_INTP_LENGTH                                0x1
#define _CM5CON1_INTP_MASK                                  0x2
#define _CM5CON1_C5INTN_POSN                                0x0
#define _CM5CON1_C5INTN_POSITION                            0x0
#define _CM5CON1_C5INTN_SIZE                                0x1
#define _CM5CON1_C5INTN_LENGTH                              0x1
#define _CM5CON1_C5INTN_MASK                                0x1
#define _CM5CON1_C5INTP_POSN                                0x1
#define _CM5CON1_C5INTP_POSITION                            0x1
#define _CM5CON1_C5INTP_SIZE                                0x1
#define _CM5CON1_C5INTP_LENGTH                              0x1
#define _CM5CON1_C5INTP_MASK                                0x2

// Register: CM5NSEL
#define CM5NSEL CM5NSEL
extern volatile unsigned char           CM5NSEL             __at(0x912);
#ifndef _LIB_BUILD
asm("CM5NSEL equ 0912h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NCH                    :4;
    };
    struct {
        unsigned C5NCH                  :4;
    };
    struct {
        unsigned C5NCH0                 :1;
        unsigned C5NCH1                 :1;
        unsigned C5NCH2                 :1;
        unsigned C5NCH3                 :1;
    };
} CM5NSELbits_t;
extern volatile CM5NSELbits_t CM5NSELbits __at(0x912);
// bitfield macros
#define _CM5NSEL_NCH_POSN                                   0x0
#define _CM5NSEL_NCH_POSITION                               0x0
#define _CM5NSEL_NCH_SIZE                                   0x4
#define _CM5NSEL_NCH_LENGTH                                 0x4
#define _CM5NSEL_NCH_MASK                                   0xF
#define _CM5NSEL_C5NCH_POSN                                 0x0
#define _CM5NSEL_C5NCH_POSITION                             0x0
#define _CM5NSEL_C5NCH_SIZE                                 0x4
#define _CM5NSEL_C5NCH_LENGTH                               0x4
#define _CM5NSEL_C5NCH_MASK                                 0xF
#define _CM5NSEL_C5NCH0_POSN                                0x0
#define _CM5NSEL_C5NCH0_POSITION                            0x0
#define _CM5NSEL_C5NCH0_SIZE                                0x1
#define _CM5NSEL_C5NCH0_LENGTH                              0x1
#define _CM5NSEL_C5NCH0_MASK                                0x1
#define _CM5NSEL_C5NCH1_POSN                                0x1
#define _CM5NSEL_C5NCH1_POSITION                            0x1
#define _CM5NSEL_C5NCH1_SIZE                                0x1
#define _CM5NSEL_C5NCH1_LENGTH                              0x1
#define _CM5NSEL_C5NCH1_MASK                                0x2
#define _CM5NSEL_C5NCH2_POSN                                0x2
#define _CM5NSEL_C5NCH2_POSITION                            0x2
#define _CM5NSEL_C5NCH2_SIZE                                0x1
#define _CM5NSEL_C5NCH2_LENGTH                              0x1
#define _CM5NSEL_C5NCH2_MASK                                0x4
#define _CM5NSEL_C5NCH3_POSN                                0x3
#define _CM5NSEL_C5NCH3_POSITION                            0x3
#define _CM5NSEL_C5NCH3_SIZE                                0x1
#define _CM5NSEL_C5NCH3_LENGTH                              0x1
#define _CM5NSEL_C5NCH3_MASK                                0x8

// Register: CM5PSEL
#define CM5PSEL CM5PSEL
extern volatile unsigned char           CM5PSEL             __at(0x913);
#ifndef _LIB_BUILD
asm("CM5PSEL equ 0913h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCH                    :4;
    };
    struct {
        unsigned PCH0                   :1;
        unsigned PCH1                   :1;
        unsigned PCH2                   :1;
        unsigned PCH3                   :1;
    };
    struct {
        unsigned C5PCH                  :4;
    };
    struct {
        unsigned C5PCH0                 :1;
        unsigned C5PCH1                 :1;
        unsigned C5PCH2                 :1;
        unsigned C5PCH3                 :1;
    };
} CM5PSELbits_t;
extern volatile CM5PSELbits_t CM5PSELbits __at(0x913);
// bitfield macros
#define _CM5PSEL_PCH_POSN                                   0x0
#define _CM5PSEL_PCH_POSITION                               0x0
#define _CM5PSEL_PCH_SIZE                                   0x4
#define _CM5PSEL_PCH_LENGTH                                 0x4
#define _CM5PSEL_PCH_MASK                                   0xF
#define _CM5PSEL_PCH0_POSN                                  0x0
#define _CM5PSEL_PCH0_POSITION                              0x0
#define _CM5PSEL_PCH0_SIZE                                  0x1
#define _CM5PSEL_PCH0_LENGTH                                0x1
#define _CM5PSEL_PCH0_MASK                                  0x1
#define _CM5PSEL_PCH1_POSN                                  0x1
#define _CM5PSEL_PCH1_POSITION                              0x1
#define _CM5PSEL_PCH1_SIZE                                  0x1
#define _CM5PSEL_PCH1_LENGTH                                0x1
#define _CM5PSEL_PCH1_MASK                                  0x2
#define _CM5PSEL_PCH2_POSN                                  0x2
#define _CM5PSEL_PCH2_POSITION                              0x2
#define _CM5PSEL_PCH2_SIZE                                  0x1
#define _CM5PSEL_PCH2_LENGTH                                0x1
#define _CM5PSEL_PCH2_MASK                                  0x4
#define _CM5PSEL_PCH3_POSN                                  0x3
#define _CM5PSEL_PCH3_POSITION                              0x3
#define _CM5PSEL_PCH3_SIZE                                  0x1
#define _CM5PSEL_PCH3_LENGTH                                0x1
#define _CM5PSEL_PCH3_MASK                                  0x8
#define _CM5PSEL_C5PCH_POSN                                 0x0
#define _CM5PSEL_C5PCH_POSITION                             0x0
#define _CM5PSEL_C5PCH_SIZE                                 0x4
#define _CM5PSEL_C5PCH_LENGTH                               0x4
#define _CM5PSEL_C5PCH_MASK                                 0xF
#define _CM5PSEL_C5PCH0_POSN                                0x0
#define _CM5PSEL_C5PCH0_POSITION                            0x0
#define _CM5PSEL_C5PCH0_SIZE                                0x1
#define _CM5PSEL_C5PCH0_LENGTH                              0x1
#define _CM5PSEL_C5PCH0_MASK                                0x1
#define _CM5PSEL_C5PCH1_POSN                                0x1
#define _CM5PSEL_C5PCH1_POSITION                            0x1
#define _CM5PSEL_C5PCH1_SIZE                                0x1
#define _CM5PSEL_C5PCH1_LENGTH                              0x1
#define _CM5PSEL_C5PCH1_MASK                                0x2
#define _CM5PSEL_C5PCH2_POSN                                0x2
#define _CM5PSEL_C5PCH2_POSITION                            0x2
#define _CM5PSEL_C5PCH2_SIZE                                0x1
#define _CM5PSEL_C5PCH2_LENGTH                              0x1
#define _CM5PSEL_C5PCH2_MASK                                0x4
#define _CM5PSEL_C5PCH3_POSN                                0x3
#define _CM5PSEL_C5PCH3_POSITION                            0x3
#define _CM5PSEL_C5PCH3_SIZE                                0x1
#define _CM5PSEL_C5PCH3_LENGTH                              0x1
#define _CM5PSEL_C5PCH3_MASK                                0x8

// Register: CM6CON0
#define CM6CON0 CM6CON0
extern volatile unsigned char           CM6CON0             __at(0x914);
#ifndef _LIB_BUILD
asm("CM6CON0 equ 0914h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SYNC                   :1;
        unsigned HYS                    :1;
        unsigned                        :1;
        unsigned ZLF                    :1;
        unsigned POL                    :1;
        unsigned                        :1;
        unsigned OUT                    :1;
        unsigned ON                     :1;
    };
    struct {
        unsigned C6SYNC                 :1;
        unsigned C6HYS                  :1;
        unsigned                        :1;
        unsigned C6ZLF                  :1;
        unsigned C6POL                  :1;
        unsigned                        :1;
        unsigned C6OUT                  :1;
        unsigned C6ON                   :1;
    };
} CM6CON0bits_t;
extern volatile CM6CON0bits_t CM6CON0bits __at(0x914);
// bitfield macros
#define _CM6CON0_SYNC_POSN                                  0x0
#define _CM6CON0_SYNC_POSITION                              0x0
#define _CM6CON0_SYNC_SIZE                                  0x1
#define _CM6CON0_SYNC_LENGTH                                0x1
#define _CM6CON0_SYNC_MASK                                  0x1
#define _CM6CON0_HYS_POSN                                   0x1
#define _CM6CON0_HYS_POSITION                               0x1
#define _CM6CON0_HYS_SIZE                                   0x1
#define _CM6CON0_HYS_LENGTH                                 0x1
#define _CM6CON0_HYS_MASK                                   0x2
#define _CM6CON0_ZLF_POSN                                   0x3
#define _CM6CON0_ZLF_POSITION                               0x3
#define _CM6CON0_ZLF_SIZE                                   0x1
#define _CM6CON0_ZLF_LENGTH                                 0x1
#define _CM6CON0_ZLF_MASK                                   0x8
#define _CM6CON0_POL_POSN                                   0x4
#define _CM6CON0_POL_POSITION                               0x4
#define _CM6CON0_POL_SIZE                                   0x1
#define _CM6CON0_POL_LENGTH                                 0x1
#define _CM6CON0_POL_MASK                                   0x10
#define _CM6CON0_OUT_POSN                                   0x6
#define _CM6CON0_OUT_POSITION                               0x6
#define _CM6CON0_OUT_SIZE                                   0x1
#define _CM6CON0_OUT_LENGTH                                 0x1
#define _CM6CON0_OUT_MASK                                   0x40
#define _CM6CON0_ON_POSN                                    0x7
#define _CM6CON0_ON_POSITION                                0x7
#define _CM6CON0_ON_SIZE                                    0x1
#define _CM6CON0_ON_LENGTH                                  0x1
#define _CM6CON0_ON_MASK                                    0x80
#define _CM6CON0_C6SYNC_POSN                                0x0
#define _CM6CON0_C6SYNC_POSITION                            0x0
#define _CM6CON0_C6SYNC_SIZE                                0x1
#define _CM6CON0_C6SYNC_LENGTH                              0x1
#define _CM6CON0_C6SYNC_MASK                                0x1
#define _CM6CON0_C6HYS_POSN                                 0x1
#define _CM6CON0_C6HYS_POSITION                             0x1
#define _CM6CON0_C6HYS_SIZE                                 0x1
#define _CM6CON0_C6HYS_LENGTH                               0x1
#define _CM6CON0_C6HYS_MASK                                 0x2
#define _CM6CON0_C6ZLF_POSN                                 0x3
#define _CM6CON0_C6ZLF_POSITION                             0x3
#define _CM6CON0_C6ZLF_SIZE                                 0x1
#define _CM6CON0_C6ZLF_LENGTH                               0x1
#define _CM6CON0_C6ZLF_MASK                                 0x8
#define _CM6CON0_C6POL_POSN                                 0x4
#define _CM6CON0_C6POL_POSITION                             0x4
#define _CM6CON0_C6POL_SIZE                                 0x1
#define _CM6CON0_C6POL_LENGTH                               0x1
#define _CM6CON0_C6POL_MASK                                 0x10
#define _CM6CON0_C6OUT_POSN                                 0x6
#define _CM6CON0_C6OUT_POSITION                             0x6
#define _CM6CON0_C6OUT_SIZE                                 0x1
#define _CM6CON0_C6OUT_LENGTH                               0x1
#define _CM6CON0_C6OUT_MASK                                 0x40
#define _CM6CON0_C6ON_POSN                                  0x7
#define _CM6CON0_C6ON_POSITION                              0x7
#define _CM6CON0_C6ON_SIZE                                  0x1
#define _CM6CON0_C6ON_LENGTH                                0x1
#define _CM6CON0_C6ON_MASK                                  0x80

// Register: CM6CON1
#define CM6CON1 CM6CON1
extern volatile unsigned char           CM6CON1             __at(0x915);
#ifndef _LIB_BUILD
asm("CM6CON1 equ 0915h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTN                   :1;
        unsigned INTP                   :1;
    };
    struct {
        unsigned C6INTN                 :1;
        unsigned C6INTP                 :1;
    };
} CM6CON1bits_t;
extern volatile CM6CON1bits_t CM6CON1bits __at(0x915);
// bitfield macros
#define _CM6CON1_INTN_POSN                                  0x0
#define _CM6CON1_INTN_POSITION                              0x0
#define _CM6CON1_INTN_SIZE                                  0x1
#define _CM6CON1_INTN_LENGTH                                0x1
#define _CM6CON1_INTN_MASK                                  0x1
#define _CM6CON1_INTP_POSN                                  0x1
#define _CM6CON1_INTP_POSITION                              0x1
#define _CM6CON1_INTP_SIZE                                  0x1
#define _CM6CON1_INTP_LENGTH                                0x1
#define _CM6CON1_INTP_MASK                                  0x2
#define _CM6CON1_C6INTN_POSN                                0x0
#define _CM6CON1_C6INTN_POSITION                            0x0
#define _CM6CON1_C6INTN_SIZE                                0x1
#define _CM6CON1_C6INTN_LENGTH                              0x1
#define _CM6CON1_C6INTN_MASK                                0x1
#define _CM6CON1_C6INTP_POSN                                0x1
#define _CM6CON1_C6INTP_POSITION                            0x1
#define _CM6CON1_C6INTP_SIZE                                0x1
#define _CM6CON1_C6INTP_LENGTH                              0x1
#define _CM6CON1_C6INTP_MASK                                0x2

// Register: CM6NSEL
#define CM6NSEL CM6NSEL
extern volatile unsigned char           CM6NSEL             __at(0x916);
#ifndef _LIB_BUILD
asm("CM6NSEL equ 0916h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NCH                    :4;
    };
    struct {
        unsigned C6NCH                  :4;
    };
    struct {
        unsigned C6NCH0                 :1;
        unsigned C6NCH1                 :1;
        unsigned C6NCH2                 :1;
        unsigned C6NCH3                 :1;
    };
} CM6NSELbits_t;
extern volatile CM6NSELbits_t CM6NSELbits __at(0x916);
// bitfield macros
#define _CM6NSEL_NCH_POSN                                   0x0
#define _CM6NSEL_NCH_POSITION                               0x0
#define _CM6NSEL_NCH_SIZE                                   0x4
#define _CM6NSEL_NCH_LENGTH                                 0x4
#define _CM6NSEL_NCH_MASK                                   0xF
#define _CM6NSEL_C6NCH_POSN                                 0x0
#define _CM6NSEL_C6NCH_POSITION                             0x0
#define _CM6NSEL_C6NCH_SIZE                                 0x4
#define _CM6NSEL_C6NCH_LENGTH                               0x4
#define _CM6NSEL_C6NCH_MASK                                 0xF
#define _CM6NSEL_C6NCH0_POSN                                0x0
#define _CM6NSEL_C6NCH0_POSITION                            0x0
#define _CM6NSEL_C6NCH0_SIZE                                0x1
#define _CM6NSEL_C6NCH0_LENGTH                              0x1
#define _CM6NSEL_C6NCH0_MASK                                0x1
#define _CM6NSEL_C6NCH1_POSN                                0x1
#define _CM6NSEL_C6NCH1_POSITION                            0x1
#define _CM6NSEL_C6NCH1_SIZE                                0x1
#define _CM6NSEL_C6NCH1_LENGTH                              0x1
#define _CM6NSEL_C6NCH1_MASK                                0x2
#define _CM6NSEL_C6NCH2_POSN                                0x2
#define _CM6NSEL_C6NCH2_POSITION                            0x2
#define _CM6NSEL_C6NCH2_SIZE                                0x1
#define _CM6NSEL_C6NCH2_LENGTH                              0x1
#define _CM6NSEL_C6NCH2_MASK                                0x4
#define _CM6NSEL_C6NCH3_POSN                                0x3
#define _CM6NSEL_C6NCH3_POSITION                            0x3
#define _CM6NSEL_C6NCH3_SIZE                                0x1
#define _CM6NSEL_C6NCH3_LENGTH                              0x1
#define _CM6NSEL_C6NCH3_MASK                                0x8

// Register: CM6PSEL
#define CM6PSEL CM6PSEL
extern volatile unsigned char           CM6PSEL             __at(0x917);
#ifndef _LIB_BUILD
asm("CM6PSEL equ 0917h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCH                    :4;
    };
    struct {
        unsigned PCH0                   :1;
        unsigned PCH1                   :1;
        unsigned PCH2                   :1;
        unsigned PCH3                   :1;
    };
    struct {
        unsigned C6PCH                  :4;
    };
    struct {
        unsigned C6PCH0                 :1;
        unsigned C6PCH1                 :1;
        unsigned C6PCH2                 :1;
        unsigned C6PCH3                 :1;
    };
} CM6PSELbits_t;
