MikroElektronika/core_packages/PIC/XC8/def/PIC16F1776/mcu.h
extern volatile PWM11PHLbits_t PWM11PHLbits __at(0xDB1);
// bitfield macros
#define _PWM11PHL_PH_POSN                                   0x0
#define _PWM11PHL_PH_POSITION                               0x0
#define _PWM11PHL_PH_SIZE                                   0x8
#define _PWM11PHL_PH_LENGTH                                 0x8
#define _PWM11PHL_PH_MASK                                   0xFF
#define _PWM11PHL_PWM11PHL0_POSN                            0x0
#define _PWM11PHL_PWM11PHL0_POSITION                        0x0
#define _PWM11PHL_PWM11PHL0_SIZE                            0x1
#define _PWM11PHL_PWM11PHL0_LENGTH                          0x1
#define _PWM11PHL_PWM11PHL0_MASK                            0x1
#define _PWM11PHL_PWM11PHL1_POSN                            0x1
#define _PWM11PHL_PWM11PHL1_POSITION                        0x1
#define _PWM11PHL_PWM11PHL1_SIZE                            0x1
#define _PWM11PHL_PWM11PHL1_LENGTH                          0x1
#define _PWM11PHL_PWM11PHL1_MASK                            0x2
#define _PWM11PHL_PWM11PHL2_POSN                            0x2
#define _PWM11PHL_PWM11PHL2_POSITION                        0x2
#define _PWM11PHL_PWM11PHL2_SIZE                            0x1
#define _PWM11PHL_PWM11PHL2_LENGTH                          0x1
#define _PWM11PHL_PWM11PHL2_MASK                            0x4
#define _PWM11PHL_PWM11PHL3_POSN                            0x3
#define _PWM11PHL_PWM11PHL3_POSITION                        0x3
#define _PWM11PHL_PWM11PHL3_SIZE                            0x1
#define _PWM11PHL_PWM11PHL3_LENGTH                          0x1
#define _PWM11PHL_PWM11PHL3_MASK                            0x8
#define _PWM11PHL_PWM11PHL4_POSN                            0x4
#define _PWM11PHL_PWM11PHL4_POSITION                        0x4
#define _PWM11PHL_PWM11PHL4_SIZE                            0x1
#define _PWM11PHL_PWM11PHL4_LENGTH                          0x1
#define _PWM11PHL_PWM11PHL4_MASK                            0x10
#define _PWM11PHL_PWM11PHL5_POSN                            0x5
#define _PWM11PHL_PWM11PHL5_POSITION                        0x5
#define _PWM11PHL_PWM11PHL5_SIZE                            0x1
#define _PWM11PHL_PWM11PHL5_LENGTH                          0x1
#define _PWM11PHL_PWM11PHL5_MASK                            0x20
#define _PWM11PHL_PWM11PHL6_POSN                            0x6
#define _PWM11PHL_PWM11PHL6_POSITION                        0x6
#define _PWM11PHL_PWM11PHL6_SIZE                            0x1
#define _PWM11PHL_PWM11PHL6_LENGTH                          0x1
#define _PWM11PHL_PWM11PHL6_MASK                            0x40
#define _PWM11PHL_PWM11PHL7_POSN                            0x7
#define _PWM11PHL_PWM11PHL7_POSITION                        0x7
#define _PWM11PHL_PWM11PHL7_SIZE                            0x1
#define _PWM11PHL_PWM11PHL7_LENGTH                          0x1
#define _PWM11PHL_PWM11PHL7_MASK                            0x80
#define _PWM11PHL_PWM11PHL_POSN                             0x0
#define _PWM11PHL_PWM11PHL_POSITION                         0x0
#define _PWM11PHL_PWM11PHL_SIZE                             0x8
#define _PWM11PHL_PWM11PHL_LENGTH                           0x8
#define _PWM11PHL_PWM11PHL_MASK                             0xFF

// Register: PWM11PHH
#define PWM11PHH PWM11PHH
extern volatile unsigned char           PWM11PHH            __at(0xDB2);
#ifndef _LIB_BUILD
asm("PWM11PHH equ 0DB2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PH                     :8;
    };
    struct {
        unsigned PWM11PHH0              :1;
        unsigned PWM11PHH1              :1;
        unsigned PWM11PHH2              :1;
        unsigned PWM11PHH3              :1;
        unsigned PWM11PHH4              :1;
        unsigned PWM11PHH5              :1;
        unsigned PWM11PHH6              :1;
        unsigned PWM11PHH7              :1;
    };
    struct {
        unsigned PWM11PHH               :8;
    };
} PWM11PHHbits_t;
extern volatile PWM11PHHbits_t PWM11PHHbits __at(0xDB2);
// bitfield macros
#define _PWM11PHH_PH_POSN                                   0x0
#define _PWM11PHH_PH_POSITION                               0x0
#define _PWM11PHH_PH_SIZE                                   0x8
#define _PWM11PHH_PH_LENGTH                                 0x8
#define _PWM11PHH_PH_MASK                                   0xFF
#define _PWM11PHH_PWM11PHH0_POSN                            0x0
#define _PWM11PHH_PWM11PHH0_POSITION                        0x0
#define _PWM11PHH_PWM11PHH0_SIZE                            0x1
#define _PWM11PHH_PWM11PHH0_LENGTH                          0x1
#define _PWM11PHH_PWM11PHH0_MASK                            0x1
#define _PWM11PHH_PWM11PHH1_POSN                            0x1
#define _PWM11PHH_PWM11PHH1_POSITION                        0x1
#define _PWM11PHH_PWM11PHH1_SIZE                            0x1
#define _PWM11PHH_PWM11PHH1_LENGTH                          0x1
#define _PWM11PHH_PWM11PHH1_MASK                            0x2
#define _PWM11PHH_PWM11PHH2_POSN                            0x2
#define _PWM11PHH_PWM11PHH2_POSITION                        0x2
#define _PWM11PHH_PWM11PHH2_SIZE                            0x1
#define _PWM11PHH_PWM11PHH2_LENGTH                          0x1
#define _PWM11PHH_PWM11PHH2_MASK                            0x4
#define _PWM11PHH_PWM11PHH3_POSN                            0x3
#define _PWM11PHH_PWM11PHH3_POSITION                        0x3
#define _PWM11PHH_PWM11PHH3_SIZE                            0x1
#define _PWM11PHH_PWM11PHH3_LENGTH                          0x1
#define _PWM11PHH_PWM11PHH3_MASK                            0x8
#define _PWM11PHH_PWM11PHH4_POSN                            0x4
#define _PWM11PHH_PWM11PHH4_POSITION                        0x4
#define _PWM11PHH_PWM11PHH4_SIZE                            0x1
#define _PWM11PHH_PWM11PHH4_LENGTH                          0x1
#define _PWM11PHH_PWM11PHH4_MASK                            0x10
#define _PWM11PHH_PWM11PHH5_POSN                            0x5
#define _PWM11PHH_PWM11PHH5_POSITION                        0x5
#define _PWM11PHH_PWM11PHH5_SIZE                            0x1
#define _PWM11PHH_PWM11PHH5_LENGTH                          0x1
#define _PWM11PHH_PWM11PHH5_MASK                            0x20
#define _PWM11PHH_PWM11PHH6_POSN                            0x6
#define _PWM11PHH_PWM11PHH6_POSITION                        0x6
#define _PWM11PHH_PWM11PHH6_SIZE                            0x1
#define _PWM11PHH_PWM11PHH6_LENGTH                          0x1
#define _PWM11PHH_PWM11PHH6_MASK                            0x40
#define _PWM11PHH_PWM11PHH7_POSN                            0x7
#define _PWM11PHH_PWM11PHH7_POSITION                        0x7
#define _PWM11PHH_PWM11PHH7_SIZE                            0x1
#define _PWM11PHH_PWM11PHH7_LENGTH                          0x1
#define _PWM11PHH_PWM11PHH7_MASK                            0x80
#define _PWM11PHH_PWM11PHH_POSN                             0x0
#define _PWM11PHH_PWM11PHH_POSITION                         0x0
#define _PWM11PHH_PWM11PHH_SIZE                             0x8
#define _PWM11PHH_PWM11PHH_LENGTH                           0x8
#define _PWM11PHH_PWM11PHH_MASK                             0xFF

// Register: PWM11DC
#define PWM11DC PWM11DC
extern volatile unsigned short          PWM11DC             __at(0xDB3);
#ifndef _LIB_BUILD
asm("PWM11DC equ 0DB3h");
#endif

// Register: PWM11DCL
#define PWM11DCL PWM11DCL
extern volatile unsigned char           PWM11DCL            __at(0xDB3);
#ifndef _LIB_BUILD
asm("PWM11DCL equ 0DB3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :8;
    };
    struct {
        unsigned PWM11DCL0              :1;
        unsigned PWM11DCL1              :1;
        unsigned PWM11DCL2              :1;
        unsigned PWM11DCL3              :1;
        unsigned PWM11DCL4              :1;
        unsigned PWM11DCL5              :1;
        unsigned PWM11DCL6              :1;
        unsigned PWM11DCL7              :1;
    };
    struct {
        unsigned PWM11DCL               :8;
    };
} PWM11DCLbits_t;
