MikroElektronika/core_packages/PIC/XC8/def/PIC16F1776/mcu.h
extern volatile PWM11CONbits_t PWM11CONbits __at(0xDBB);
// bitfield macros
#define _PWM11CON_MODE_POSN                                 0x2
#define _PWM11CON_MODE_POSITION                             0x2
#define _PWM11CON_MODE_SIZE                                 0x2
#define _PWM11CON_MODE_LENGTH                               0x2
#define _PWM11CON_MODE_MASK                                 0xC
#define _PWM11CON_POL_POSN                                  0x4
#define _PWM11CON_POL_POSITION                              0x4
#define _PWM11CON_POL_SIZE                                  0x1
#define _PWM11CON_POL_LENGTH                                0x1
#define _PWM11CON_POL_MASK                                  0x10
#define _PWM11CON_OUT_POSN                                  0x5
#define _PWM11CON_OUT_POSITION                              0x5
#define _PWM11CON_OUT_SIZE                                  0x1
#define _PWM11CON_OUT_LENGTH                                0x1
#define _PWM11CON_OUT_MASK                                  0x20
#define _PWM11CON_EN_POSN                                   0x7
#define _PWM11CON_EN_POSITION                               0x7
#define _PWM11CON_EN_SIZE                                   0x1
#define _PWM11CON_EN_LENGTH                                 0x1
#define _PWM11CON_EN_MASK                                   0x80
#define _PWM11CON_PWM11MODE0_POSN                           0x2
#define _PWM11CON_PWM11MODE0_POSITION                       0x2
#define _PWM11CON_PWM11MODE0_SIZE                           0x1
#define _PWM11CON_PWM11MODE0_LENGTH                         0x1
#define _PWM11CON_PWM11MODE0_MASK                           0x4
#define _PWM11CON_PWM11MODE1_POSN                           0x3
#define _PWM11CON_PWM11MODE1_POSITION                       0x3
#define _PWM11CON_PWM11MODE1_SIZE                           0x1
#define _PWM11CON_PWM11MODE1_LENGTH                         0x1
#define _PWM11CON_PWM11MODE1_MASK                           0x8
#define _PWM11CON_PWM11MODE_POSN                            0x2
#define _PWM11CON_PWM11MODE_POSITION                        0x2
#define _PWM11CON_PWM11MODE_SIZE                            0x2
#define _PWM11CON_PWM11MODE_LENGTH                          0x2
#define _PWM11CON_PWM11MODE_MASK                            0xC
#define _PWM11CON_PWM11POL_POSN                             0x4
#define _PWM11CON_PWM11POL_POSITION                         0x4
#define _PWM11CON_PWM11POL_SIZE                             0x1
#define _PWM11CON_PWM11POL_LENGTH                           0x1
#define _PWM11CON_PWM11POL_MASK                             0x10
#define _PWM11CON_PWM11OUT_POSN                             0x5
#define _PWM11CON_PWM11OUT_POSITION                         0x5
#define _PWM11CON_PWM11OUT_SIZE                             0x1
#define _PWM11CON_PWM11OUT_LENGTH                           0x1
#define _PWM11CON_PWM11OUT_MASK                             0x20
#define _PWM11CON_PWM11EN_POSN                              0x7
#define _PWM11CON_PWM11EN_POSITION                          0x7
#define _PWM11CON_PWM11EN_SIZE                              0x1
#define _PWM11CON_PWM11EN_LENGTH                            0x1
#define _PWM11CON_PWM11EN_MASK                              0x80
#define _PWM11CON_MODE0_POSN                                0x2
#define _PWM11CON_MODE0_POSITION                            0x2
#define _PWM11CON_MODE0_SIZE                                0x1
#define _PWM11CON_MODE0_LENGTH                              0x1
#define _PWM11CON_MODE0_MASK                                0x4
#define _PWM11CON_MODE1_POSN                                0x3
#define _PWM11CON_MODE1_POSITION                            0x3
#define _PWM11CON_MODE1_SIZE                                0x1
#define _PWM11CON_MODE1_LENGTH                              0x1
#define _PWM11CON_MODE1_MASK                                0x8

// Register: PWM11INTE
#define PWM11INTE PWM11INTE
extern volatile unsigned char           PWM11INTE           __at(0xDBC);
#ifndef _LIB_BUILD
asm("PWM11INTE equ 0DBCh");
#endif
// aliases
extern volatile unsigned char           PWM11INTCON         __at(0xDBC);
#ifndef _LIB_BUILD
asm("PWM11INTCON equ 0DBCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRIE                   :1;
        unsigned DCIE                   :1;
        unsigned PHIE                   :1;
        unsigned OFIE                   :1;
    };
    struct {
        unsigned PWM11PRIE              :1;
        unsigned PWM11DCIE              :1;
        unsigned PWM11PHIE              :1;
        unsigned PWM11OFIE              :1;
    };
} PWM11INTEbits_t;
extern volatile PWM11INTEbits_t PWM11INTEbits __at(0xDBC);
// bitfield macros
#define _PWM11INTE_PRIE_POSN                                0x0
#define _PWM11INTE_PRIE_POSITION                            0x0
#define _PWM11INTE_PRIE_SIZE                                0x1
#define _PWM11INTE_PRIE_LENGTH                              0x1
#define _PWM11INTE_PRIE_MASK                                0x1
#define _PWM11INTE_DCIE_POSN                                0x1
#define _PWM11INTE_DCIE_POSITION                            0x1
#define _PWM11INTE_DCIE_SIZE                                0x1
#define _PWM11INTE_DCIE_LENGTH                              0x1
#define _PWM11INTE_DCIE_MASK                                0x2
#define _PWM11INTE_PHIE_POSN                                0x2
#define _PWM11INTE_PHIE_POSITION                            0x2
#define _PWM11INTE_PHIE_SIZE                                0x1
#define _PWM11INTE_PHIE_LENGTH                              0x1
#define _PWM11INTE_PHIE_MASK                                0x4
#define _PWM11INTE_OFIE_POSN                                0x3
#define _PWM11INTE_OFIE_POSITION                            0x3
#define _PWM11INTE_OFIE_SIZE                                0x1
#define _PWM11INTE_OFIE_LENGTH                              0x1
#define _PWM11INTE_OFIE_MASK                                0x8
#define _PWM11INTE_PWM11PRIE_POSN                           0x0
#define _PWM11INTE_PWM11PRIE_POSITION                       0x0
#define _PWM11INTE_PWM11PRIE_SIZE                           0x1
#define _PWM11INTE_PWM11PRIE_LENGTH                         0x1
#define _PWM11INTE_PWM11PRIE_MASK                           0x1
#define _PWM11INTE_PWM11DCIE_POSN                           0x1
#define _PWM11INTE_PWM11DCIE_POSITION                       0x1
#define _PWM11INTE_PWM11DCIE_SIZE                           0x1
#define _PWM11INTE_PWM11DCIE_LENGTH                         0x1
#define _PWM11INTE_PWM11DCIE_MASK                           0x2
#define _PWM11INTE_PWM11PHIE_POSN                           0x2
#define _PWM11INTE_PWM11PHIE_POSITION                       0x2
#define _PWM11INTE_PWM11PHIE_SIZE                           0x1
#define _PWM11INTE_PWM11PHIE_LENGTH                         0x1
#define _PWM11INTE_PWM11PHIE_MASK                           0x4
#define _PWM11INTE_PWM11OFIE_POSN                           0x3
#define _PWM11INTE_PWM11OFIE_POSITION                       0x3
#define _PWM11INTE_PWM11OFIE_SIZE                           0x1
#define _PWM11INTE_PWM11OFIE_LENGTH                         0x1
#define _PWM11INTE_PWM11OFIE_MASK                           0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned PRIE                   :1;
        unsigned DCIE                   :1;
        unsigned PHIE                   :1;
        unsigned OFIE                   :1;
    };
    struct {
        unsigned PWM11PRIE              :1;
        unsigned PWM11DCIE              :1;
        unsigned PWM11PHIE              :1;
        unsigned PWM11OFIE              :1;
    };
} PWM11INTCONbits_t;
