MikroElektronika/core_packages/PIC/XC8/def/PIC16F1776/mcu.h
extern volatile PWM11INTFLGbits_t PWM11INTFLGbits __at(0xDBD);
// bitfield macros
#define _PWM11INTFLG_PRIF_POSN                              0x0
#define _PWM11INTFLG_PRIF_POSITION                          0x0
#define _PWM11INTFLG_PRIF_SIZE                              0x1
#define _PWM11INTFLG_PRIF_LENGTH                            0x1
#define _PWM11INTFLG_PRIF_MASK                              0x1
#define _PWM11INTFLG_DCIF_POSN                              0x1
#define _PWM11INTFLG_DCIF_POSITION                          0x1
#define _PWM11INTFLG_DCIF_SIZE                              0x1
#define _PWM11INTFLG_DCIF_LENGTH                            0x1
#define _PWM11INTFLG_DCIF_MASK                              0x2
#define _PWM11INTFLG_PHIF_POSN                              0x2
#define _PWM11INTFLG_PHIF_POSITION                          0x2
#define _PWM11INTFLG_PHIF_SIZE                              0x1
#define _PWM11INTFLG_PHIF_LENGTH                            0x1
#define _PWM11INTFLG_PHIF_MASK                              0x4
#define _PWM11INTFLG_OFIF_POSN                              0x3
#define _PWM11INTFLG_OFIF_POSITION                          0x3
#define _PWM11INTFLG_OFIF_SIZE                              0x1
#define _PWM11INTFLG_OFIF_LENGTH                            0x1
#define _PWM11INTFLG_OFIF_MASK                              0x8
#define _PWM11INTFLG_PWM11PRIF_POSN                         0x0
#define _PWM11INTFLG_PWM11PRIF_POSITION                     0x0
#define _PWM11INTFLG_PWM11PRIF_SIZE                         0x1
#define _PWM11INTFLG_PWM11PRIF_LENGTH                       0x1
#define _PWM11INTFLG_PWM11PRIF_MASK                         0x1
#define _PWM11INTFLG_PWM11DCIF_POSN                         0x1
#define _PWM11INTFLG_PWM11DCIF_POSITION                     0x1
#define _PWM11INTFLG_PWM11DCIF_SIZE                         0x1
#define _PWM11INTFLG_PWM11DCIF_LENGTH                       0x1
#define _PWM11INTFLG_PWM11DCIF_MASK                         0x2
#define _PWM11INTFLG_PWM11PHIF_POSN                         0x2
#define _PWM11INTFLG_PWM11PHIF_POSITION                     0x2
#define _PWM11INTFLG_PWM11PHIF_SIZE                         0x1
#define _PWM11INTFLG_PWM11PHIF_LENGTH                       0x1
#define _PWM11INTFLG_PWM11PHIF_MASK                         0x4
#define _PWM11INTFLG_PWM11OFIF_POSN                         0x3
#define _PWM11INTFLG_PWM11OFIF_POSITION                     0x3
#define _PWM11INTFLG_PWM11OFIF_SIZE                         0x1
#define _PWM11INTFLG_PWM11OFIF_LENGTH                       0x1
#define _PWM11INTFLG_PWM11OFIF_MASK                         0x8

// Register: PWM11CLKCON
#define PWM11CLKCON PWM11CLKCON
extern volatile unsigned char           PWM11CLKCON         __at(0xDBE);
#ifndef _LIB_BUILD
asm("PWM11CLKCON equ 0DBEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :2;
        unsigned                        :2;
        unsigned PS                     :3;
    };
    struct {
        unsigned PWM11CS0               :1;
        unsigned PWM11CS1               :1;
        unsigned PWM11CS2               :1;
        unsigned                        :1;
        unsigned PWM11PS0               :1;
        unsigned PWM11PS1               :1;
        unsigned PWM11PS2               :1;
    };
    struct {
        unsigned PWM11CS                :3;
        unsigned                        :1;
        unsigned PWM11PS                :3;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned CS2                    :1;
        unsigned                        :1;
        unsigned _PS0                    :1;  // Note: Changed by MikroE
        unsigned _PS1                    :1;  // Note: Changed by MikroE
        unsigned _PS2                    :1;  // Note: Changed by MikroE
    };
} PWM11CLKCONbits_t;
extern volatile PWM11CLKCONbits_t PWM11CLKCONbits __at(0xDBE);
// bitfield macros
#define _PWM11CLKCON_CS_POSN                                0x0
#define _PWM11CLKCON_CS_POSITION                            0x0
#define _PWM11CLKCON_CS_SIZE                                0x2
#define _PWM11CLKCON_CS_LENGTH                              0x2
#define _PWM11CLKCON_CS_MASK                                0x3
#define _PWM11CLKCON_PS_POSN                                0x4
#define _PWM11CLKCON_PS_POSITION                            0x4
#define _PWM11CLKCON_PS_SIZE                                0x3
#define _PWM11CLKCON_PS_LENGTH                              0x3
#define _PWM11CLKCON_PS_MASK                                0x70
#define _PWM11CLKCON_PWM11CS0_POSN                          0x0
#define _PWM11CLKCON_PWM11CS0_POSITION                      0x0
#define _PWM11CLKCON_PWM11CS0_SIZE                          0x1
#define _PWM11CLKCON_PWM11CS0_LENGTH                        0x1
#define _PWM11CLKCON_PWM11CS0_MASK                          0x1
#define _PWM11CLKCON_PWM11CS1_POSN                          0x1
#define _PWM11CLKCON_PWM11CS1_POSITION                      0x1
#define _PWM11CLKCON_PWM11CS1_SIZE                          0x1
#define _PWM11CLKCON_PWM11CS1_LENGTH                        0x1
#define _PWM11CLKCON_PWM11CS1_MASK                          0x2
#define _PWM11CLKCON_PWM11CS2_POSN                          0x2
#define _PWM11CLKCON_PWM11CS2_POSITION                      0x2
#define _PWM11CLKCON_PWM11CS2_SIZE                          0x1
#define _PWM11CLKCON_PWM11CS2_LENGTH                        0x1
#define _PWM11CLKCON_PWM11CS2_MASK                          0x4
#define _PWM11CLKCON_PWM11PS0_POSN                          0x4
#define _PWM11CLKCON_PWM11PS0_POSITION                      0x4
#define _PWM11CLKCON_PWM11PS0_SIZE                          0x1
#define _PWM11CLKCON_PWM11PS0_LENGTH                        0x1
#define _PWM11CLKCON_PWM11PS0_MASK                          0x10
#define _PWM11CLKCON_PWM11PS1_POSN                          0x5
#define _PWM11CLKCON_PWM11PS1_POSITION                      0x5
#define _PWM11CLKCON_PWM11PS1_SIZE                          0x1
#define _PWM11CLKCON_PWM11PS1_LENGTH                        0x1
#define _PWM11CLKCON_PWM11PS1_MASK                          0x20
#define _PWM11CLKCON_PWM11PS2_POSN                          0x6
#define _PWM11CLKCON_PWM11PS2_POSITION                      0x6
#define _PWM11CLKCON_PWM11PS2_SIZE                          0x1
#define _PWM11CLKCON_PWM11PS2_LENGTH                        0x1
#define _PWM11CLKCON_PWM11PS2_MASK                          0x40
#define _PWM11CLKCON_PWM11CS_POSN                           0x0
#define _PWM11CLKCON_PWM11CS_POSITION                       0x0
#define _PWM11CLKCON_PWM11CS_SIZE                           0x3
#define _PWM11CLKCON_PWM11CS_LENGTH                         0x3
#define _PWM11CLKCON_PWM11CS_MASK                           0x7
#define _PWM11CLKCON_PWM11PS_POSN                           0x4
#define _PWM11CLKCON_PWM11PS_POSITION                       0x4
#define _PWM11CLKCON_PWM11PS_SIZE                           0x3
#define _PWM11CLKCON_PWM11PS_LENGTH                         0x3
#define _PWM11CLKCON_PWM11PS_MASK                           0x70
#define _PWM11CLKCON_CS0_POSN                               0x0
#define _PWM11CLKCON_CS0_POSITION                           0x0
#define _PWM11CLKCON_CS0_SIZE                               0x1
#define _PWM11CLKCON_CS0_LENGTH                             0x1
#define _PWM11CLKCON_CS0_MASK                               0x1
#define _PWM11CLKCON_CS1_POSN                               0x1
#define _PWM11CLKCON_CS1_POSITION                           0x1
#define _PWM11CLKCON_CS1_SIZE                               0x1
#define _PWM11CLKCON_CS1_LENGTH                             0x1
#define _PWM11CLKCON_CS1_MASK                               0x2
#define _PWM11CLKCON_CS2_POSN                               0x2
#define _PWM11CLKCON_CS2_POSITION                           0x2
#define _PWM11CLKCON_CS2_SIZE                               0x1
#define _PWM11CLKCON_CS2_LENGTH                             0x1
#define _PWM11CLKCON_CS2_MASK                               0x4
#define _PWM11CLKCON_PS0_POSN                               0x4
#define _PWM11CLKCON_PS0_POSITION                           0x4
#define _PWM11CLKCON_PS0_SIZE                               0x1
#define _PWM11CLKCON_PS0_LENGTH                             0x1
#define _PWM11CLKCON_PS0_MASK                               0x10
#define _PWM11CLKCON_PS1_POSN                               0x5
#define _PWM11CLKCON_PS1_POSITION                           0x5
#define _PWM11CLKCON_PS1_SIZE                               0x1
#define _PWM11CLKCON_PS1_LENGTH                             0x1
#define _PWM11CLKCON_PS1_MASK                               0x20
#define _PWM11CLKCON_PS2_POSN                               0x6
#define _PWM11CLKCON_PS2_POSITION                           0x6
#define _PWM11CLKCON_PS2_SIZE                               0x1
#define _PWM11CLKCON_PS2_LENGTH                             0x1
#define _PWM11CLKCON_PS2_MASK                               0x40

// Register: PWM11LDCON
#define PWM11LDCON PWM11LDCON
extern volatile unsigned char           PWM11LDCON          __at(0xDBF);
#ifndef _LIB_BUILD
asm("PWM11LDCON equ 0DBFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LDS                    :2;
        unsigned                        :4;
        unsigned LDT                    :1;
        unsigned LDA                    :1;
    };
    struct {
        unsigned PWM11LDS0              :1;
        unsigned PWM11LDS1              :1;
    };
    struct {
        unsigned PWM11LDS               :2;
        unsigned                        :4;
        unsigned PWM11LDM               :1;
        unsigned PWM11LD                :1;
    };
    struct {
        unsigned LDS0                   :1;
        unsigned LDS1                   :1;
    };
} PWM11LDCONbits_t;
extern volatile PWM11LDCONbits_t PWM11LDCONbits __at(0xDBF);
// bitfield macros
#define _PWM11LDCON_LDS_POSN                                0x0
#define _PWM11LDCON_LDS_POSITION                            0x0
#define _PWM11LDCON_LDS_SIZE                                0x2
#define _PWM11LDCON_LDS_LENGTH                              0x2
#define _PWM11LDCON_LDS_MASK                                0x3
#define _PWM11LDCON_LDT_POSN                                0x6
#define _PWM11LDCON_LDT_POSITION                            0x6
#define _PWM11LDCON_LDT_SIZE                                0x1
#define _PWM11LDCON_LDT_LENGTH                              0x1
#define _PWM11LDCON_LDT_MASK                                0x40
#define _PWM11LDCON_LDA_POSN                                0x7
#define _PWM11LDCON_LDA_POSITION                            0x7
#define _PWM11LDCON_LDA_SIZE                                0x1
#define _PWM11LDCON_LDA_LENGTH                              0x1
#define _PWM11LDCON_LDA_MASK                                0x80
#define _PWM11LDCON_PWM11LDS0_POSN                          0x0
#define _PWM11LDCON_PWM11LDS0_POSITION                      0x0
#define _PWM11LDCON_PWM11LDS0_SIZE                          0x1
#define _PWM11LDCON_PWM11LDS0_LENGTH                        0x1
#define _PWM11LDCON_PWM11LDS0_MASK                          0x1
#define _PWM11LDCON_PWM11LDS1_POSN                          0x1
#define _PWM11LDCON_PWM11LDS1_POSITION                      0x1
#define _PWM11LDCON_PWM11LDS1_SIZE                          0x1
#define _PWM11LDCON_PWM11LDS1_LENGTH                        0x1
#define _PWM11LDCON_PWM11LDS1_MASK                          0x2
#define _PWM11LDCON_PWM11LDS_POSN                           0x0
#define _PWM11LDCON_PWM11LDS_POSITION                       0x0
#define _PWM11LDCON_PWM11LDS_SIZE                           0x2
#define _PWM11LDCON_PWM11LDS_LENGTH                         0x2
#define _PWM11LDCON_PWM11LDS_MASK                           0x3
#define _PWM11LDCON_PWM11LDM_POSN                           0x6
#define _PWM11LDCON_PWM11LDM_POSITION                       0x6
#define _PWM11LDCON_PWM11LDM_SIZE                           0x1
#define _PWM11LDCON_PWM11LDM_LENGTH                         0x1
#define _PWM11LDCON_PWM11LDM_MASK                           0x40
#define _PWM11LDCON_PWM11LD_POSN                            0x7
#define _PWM11LDCON_PWM11LD_POSITION                        0x7
#define _PWM11LDCON_PWM11LD_SIZE                            0x1
#define _PWM11LDCON_PWM11LD_LENGTH                          0x1
#define _PWM11LDCON_PWM11LD_MASK                            0x80
#define _PWM11LDCON_LDS0_POSN                               0x0
#define _PWM11LDCON_LDS0_POSITION                           0x0
#define _PWM11LDCON_LDS0_SIZE                               0x1
#define _PWM11LDCON_LDS0_LENGTH                             0x1
#define _PWM11LDCON_LDS0_MASK                               0x1
#define _PWM11LDCON_LDS1_POSN                               0x1
#define _PWM11LDCON_LDS1_POSITION                           0x1
#define _PWM11LDCON_LDS1_SIZE                               0x1
#define _PWM11LDCON_LDS1_LENGTH                             0x1
#define _PWM11LDCON_LDS1_MASK                               0x2

