MikroElektronika/core_packages/PIC/XC8/def/PIC16F1776/mcu.h
extern volatile INTPPSbits_t INTPPSbits __at(0xE0D);
// bitfield macros
#define _INTPPS_INTPPS_POSN                                 0x0
#define _INTPPS_INTPPS_POSITION                             0x0
#define _INTPPS_INTPPS_SIZE                                 0x6
#define _INTPPS_INTPPS_LENGTH                               0x6
#define _INTPPS_INTPPS_MASK                                 0x3F

// Register: T0CKIPPS
#define T0CKIPPS T0CKIPPS
extern volatile unsigned char           T0CKIPPS            __at(0xE0E);
#ifndef _LIB_BUILD
asm("T0CKIPPS equ 0E0Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T0CKIPPS               :6;
    };
} T0CKIPPSbits_t;
extern volatile T0CKIPPSbits_t T0CKIPPSbits __at(0xE0E);
// bitfield macros
#define _T0CKIPPS_T0CKIPPS_POSN                             0x0
#define _T0CKIPPS_T0CKIPPS_POSITION                         0x0
#define _T0CKIPPS_T0CKIPPS_SIZE                             0x6
#define _T0CKIPPS_T0CKIPPS_LENGTH                           0x6
#define _T0CKIPPS_T0CKIPPS_MASK                             0x3F

// Register: T1CKIPPS
#define T1CKIPPS T1CKIPPS
extern volatile unsigned char           T1CKIPPS            __at(0xE0F);
#ifndef _LIB_BUILD
asm("T1CKIPPS equ 0E0Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T1CKIPPS               :6;
    };
} T1CKIPPSbits_t;
extern volatile T1CKIPPSbits_t T1CKIPPSbits __at(0xE0F);
// bitfield macros
#define _T1CKIPPS_T1CKIPPS_POSN                             0x0
#define _T1CKIPPS_T1CKIPPS_POSITION                         0x0
#define _T1CKIPPS_T1CKIPPS_SIZE                             0x6
#define _T1CKIPPS_T1CKIPPS_LENGTH                           0x6
#define _T1CKIPPS_T1CKIPPS_MASK                             0x3F

// Register: T1GPPS
#define T1GPPS T1GPPS
extern volatile unsigned char           T1GPPS              __at(0xE10);
#ifndef _LIB_BUILD
asm("T1GPPS equ 0E10h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T1GPPS                 :6;
    };
} T1GPPSbits_t;
extern volatile T1GPPSbits_t T1GPPSbits __at(0xE10);
// bitfield macros
#define _T1GPPS_T1GPPS_POSN                                 0x0
#define _T1GPPS_T1GPPS_POSITION                             0x0
#define _T1GPPS_T1GPPS_SIZE                                 0x6
#define _T1GPPS_T1GPPS_LENGTH                               0x6
#define _T1GPPS_T1GPPS_MASK                                 0x3F

// Register: T3CKIPPS
#define T3CKIPPS T3CKIPPS
extern volatile unsigned char           T3CKIPPS            __at(0xE11);
#ifndef _LIB_BUILD
asm("T3CKIPPS equ 0E11h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T3CKIPPS               :6;
    };
} T3CKIPPSbits_t;
extern volatile T3CKIPPSbits_t T3CKIPPSbits __at(0xE11);
// bitfield macros
#define _T3CKIPPS_T3CKIPPS_POSN                             0x0
#define _T3CKIPPS_T3CKIPPS_POSITION                         0x0
#define _T3CKIPPS_T3CKIPPS_SIZE                             0x6
#define _T3CKIPPS_T3CKIPPS_LENGTH                           0x6
#define _T3CKIPPS_T3CKIPPS_MASK                             0x3F

// Register: T3GPPS
#define T3GPPS T3GPPS
extern volatile unsigned char           T3GPPS              __at(0xE12);
#ifndef _LIB_BUILD
asm("T3GPPS equ 0E12h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T3GPPS                 :6;
    };
} T3GPPSbits_t;
extern volatile T3GPPSbits_t T3GPPSbits __at(0xE12);
// bitfield macros
#define _T3GPPS_T3GPPS_POSN                                 0x0
#define _T3GPPS_T3GPPS_POSITION                             0x0
#define _T3GPPS_T3GPPS_SIZE                                 0x6
#define _T3GPPS_T3GPPS_LENGTH                               0x6
#define _T3GPPS_T3GPPS_MASK                                 0x3F

// Register: T5CKIPPS
#define T5CKIPPS T5CKIPPS
extern volatile unsigned char           T5CKIPPS            __at(0xE13);
#ifndef _LIB_BUILD
asm("T5CKIPPS equ 0E13h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T5CKIPPS               :6;
    };
} T5CKIPPSbits_t;
extern volatile T5CKIPPSbits_t T5CKIPPSbits __at(0xE13);
// bitfield macros
#define _T5CKIPPS_T5CKIPPS_POSN                             0x0
#define _T5CKIPPS_T5CKIPPS_POSITION                         0x0
#define _T5CKIPPS_T5CKIPPS_SIZE                             0x6
#define _T5CKIPPS_T5CKIPPS_LENGTH                           0x6
#define _T5CKIPPS_T5CKIPPS_MASK                             0x3F

// Register: T5GPPS
#define T5GPPS T5GPPS
extern volatile unsigned char           T5GPPS              __at(0xE14);
#ifndef _LIB_BUILD
asm("T5GPPS equ 0E14h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T5GPPS                 :6;
    };
} T5GPPSbits_t;
extern volatile T5GPPSbits_t T5GPPSbits __at(0xE14);
// bitfield macros
#define _T5GPPS_T5GPPS_POSN                                 0x0
#define _T5GPPS_T5GPPS_POSITION                             0x0
#define _T5GPPS_T5GPPS_SIZE                                 0x6
#define _T5GPPS_T5GPPS_LENGTH                               0x6
#define _T5GPPS_T5GPPS_MASK                                 0x3F

// Register: T2INPPS
#define T2INPPS T2INPPS
extern volatile unsigned char           T2INPPS             __at(0xE15);
#ifndef _LIB_BUILD
asm("T2INPPS equ 0E15h");
#endif
// aliases
extern volatile unsigned char           T2CKIPPS            __at(0xE15);
#ifndef _LIB_BUILD
asm("T2CKIPPS equ 0E15h");
#endif
extern volatile unsigned char           T2PPS               __at(0xE15);
#ifndef _LIB_BUILD
asm("T2PPS equ 0E15h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T2INPPS                :6;
    };
} T2INPPSbits_t;
extern volatile T2INPPSbits_t T2INPPSbits __at(0xE15);
// bitfield macros
#define _T2INPPS_T2INPPS_POSN                               0x0
#define _T2INPPS_T2INPPS_POSITION                           0x0
#define _T2INPPS_T2INPPS_SIZE                               0x6
#define _T2INPPS_T2INPPS_LENGTH                             0x6
#define _T2INPPS_T2INPPS_MASK                               0x3F
// alias bitfield definitions
typedef union {
    struct {
        unsigned T2INPPS                :6;
    };
} T2CKIPPSbits_t;
extern volatile T2CKIPPSbits_t T2CKIPPSbits __at(0xE15);
// bitfield macros
#define _T2CKIPPS_T2INPPS_POSN                              0x0
#define _T2CKIPPS_T2INPPS_POSITION                          0x0
#define _T2CKIPPS_T2INPPS_SIZE                              0x6
#define _T2CKIPPS_T2INPPS_LENGTH                            0x6
#define _T2CKIPPS_T2INPPS_MASK                              0x3F
typedef union {
    struct {
        unsigned T2INPPS                :6;
    };
} T2PPSbits_t;
