MikroElektronika/core_packages/PIC/XC8/def/PIC16F1776/mcu.h
extern volatile __bit                   C4INTP              __at(0x4869);	// @ (0x90D * 8 + 1)
#define                                 C4INTP_bit          _BIT_ACCESS(CM4CON1,1)
// CM4NSEL<C4NCH0>
extern volatile __bit                   C4NCH0              __at(0x4870);	// @ (0x90E * 8 + 0)
#define                                 C4NCH0_bit          _BIT_ACCESS(CM4NSEL,0)
// CM4NSEL<C4NCH1>
extern volatile __bit                   C4NCH1              __at(0x4871);	// @ (0x90E * 8 + 1)
#define                                 C4NCH1_bit          _BIT_ACCESS(CM4NSEL,1)
// CM4NSEL<C4NCH2>
extern volatile __bit                   C4NCH2              __at(0x4872);	// @ (0x90E * 8 + 2)
#define                                 C4NCH2_bit          _BIT_ACCESS(CM4NSEL,2)
// CM4NSEL<C4NCH3>
extern volatile __bit                   C4NCH3              __at(0x4873);	// @ (0x90E * 8 + 3)
#define                                 C4NCH3_bit          _BIT_ACCESS(CM4NSEL,3)
// CM4CON0<C4ON>
extern volatile __bit                   C4ON                __at(0x4867);	// @ (0x90C * 8 + 7)
#define                                 C4ON_bit            _BIT_ACCESS(CM4CON0,7)
// CM4CON0<C4OUT>
extern volatile __bit                   C4OUT               __at(0x4866);	// @ (0x90C * 8 + 6)
#define                                 C4OUT_bit           _BIT_ACCESS(CM4CON0,6)
// CM4PSEL<C4PCH0>
extern volatile __bit                   C4PCH0              __at(0x4878);	// @ (0x90F * 8 + 0)
#define                                 C4PCH0_bit          _BIT_ACCESS(CM4PSEL,0)
// CM4PSEL<C4PCH1>
extern volatile __bit                   C4PCH1              __at(0x4879);	// @ (0x90F * 8 + 1)
#define                                 C4PCH1_bit          _BIT_ACCESS(CM4PSEL,1)
// CM4PSEL<C4PCH2>
extern volatile __bit                   C4PCH2              __at(0x487A);	// @ (0x90F * 8 + 2)
#define                                 C4PCH2_bit          _BIT_ACCESS(CM4PSEL,2)
// CM4PSEL<C4PCH3>
extern volatile __bit                   C4PCH3              __at(0x487B);	// @ (0x90F * 8 + 3)
#define                                 C4PCH3_bit          _BIT_ACCESS(CM4PSEL,3)
// CM4CON0<C4POL>
extern volatile __bit                   C4POL               __at(0x4864);	// @ (0x90C * 8 + 4)
#define                                 C4POL_bit           _BIT_ACCESS(CM4CON0,4)
// CM4CON0<C4SYNC>
extern volatile __bit                   C4SYNC              __at(0x4860);	// @ (0x90C * 8 + 0)
#define                                 C4SYNC_bit          _BIT_ACCESS(CM4CON0,0)
// CM4CON0<C4ZLF>
extern volatile __bit                   C4ZLF               __at(0x4863);	// @ (0x90C * 8 + 3)
#define                                 C4ZLF_bit           _BIT_ACCESS(CM4CON0,3)
// CM5CON0<C5HYS>
extern volatile __bit                   C5HYS               __at(0x4881);	// @ (0x910 * 8 + 1)
#define                                 C5HYS_bit           _BIT_ACCESS(CM5CON0,1)
// PIE5<C5IE>
extern volatile __bit                   C5IE                __at(0x4A8);	// @ (0x95 * 8 + 0)
#define                                 C5IE_bit            _BIT_ACCESS(PIE5,0)
// PIR5<C5IF>
extern volatile __bit                   C5IF                __at(0xA8);	// @ (0x15 * 8 + 0)
#define                                 C5IF_bit            _BIT_ACCESS(PIR5,0)
// CM5CON1<C5INTN>
extern volatile __bit                   C5INTN              __at(0x4888);	// @ (0x911 * 8 + 0)
#define                                 C5INTN_bit          _BIT_ACCESS(CM5CON1,0)
// CM5CON1<C5INTP>
extern volatile __bit                   C5INTP              __at(0x4889);	// @ (0x911 * 8 + 1)
#define                                 C5INTP_bit          _BIT_ACCESS(CM5CON1,1)
// CM5NSEL<C5NCH0>
extern volatile __bit                   C5NCH0              __at(0x4890);	// @ (0x912 * 8 + 0)
#define                                 C5NCH0_bit          _BIT_ACCESS(CM5NSEL,0)
// CM5NSEL<C5NCH1>
extern volatile __bit                   C5NCH1              __at(0x4891);	// @ (0x912 * 8 + 1)
#define                                 C5NCH1_bit          _BIT_ACCESS(CM5NSEL,1)
// CM5NSEL<C5NCH2>
extern volatile __bit                   C5NCH2              __at(0x4892);	// @ (0x912 * 8 + 2)
#define                                 C5NCH2_bit          _BIT_ACCESS(CM5NSEL,2)
// CM5NSEL<C5NCH3>
extern volatile __bit                   C5NCH3              __at(0x4893);	// @ (0x912 * 8 + 3)
#define                                 C5NCH3_bit          _BIT_ACCESS(CM5NSEL,3)
// CM5CON0<C5ON>
extern volatile __bit                   C5ON                __at(0x4887);	// @ (0x910 * 8 + 7)
#define                                 C5ON_bit            _BIT_ACCESS(CM5CON0,7)
// CM5CON0<C5OUT>
extern volatile __bit                   C5OUT               __at(0x4886);	// @ (0x910 * 8 + 6)
#define                                 C5OUT_bit           _BIT_ACCESS(CM5CON0,6)
// CM5PSEL<C5PCH0>
extern volatile __bit                   C5PCH0              __at(0x4898);	// @ (0x913 * 8 + 0)
#define                                 C5PCH0_bit          _BIT_ACCESS(CM5PSEL,0)
// CM5PSEL<C5PCH1>
extern volatile __bit                   C5PCH1              __at(0x4899);	// @ (0x913 * 8 + 1)
#define                                 C5PCH1_bit          _BIT_ACCESS(CM5PSEL,1)
// CM5PSEL<C5PCH2>
extern volatile __bit                   C5PCH2              __at(0x489A);	// @ (0x913 * 8 + 2)
#define                                 C5PCH2_bit          _BIT_ACCESS(CM5PSEL,2)
// CM5PSEL<C5PCH3>
extern volatile __bit                   C5PCH3              __at(0x489B);	// @ (0x913 * 8 + 3)
#define                                 C5PCH3_bit          _BIT_ACCESS(CM5PSEL,3)
// CM5CON0<C5POL>
extern volatile __bit                   C5POL               __at(0x4884);	// @ (0x910 * 8 + 4)
#define                                 C5POL_bit           _BIT_ACCESS(CM5CON0,4)
// CM5CON0<C5SYNC>
extern volatile __bit                   C5SYNC              __at(0x4880);	// @ (0x910 * 8 + 0)
#define                                 C5SYNC_bit          _BIT_ACCESS(CM5CON0,0)
// CM5CON0<C5ZLF>
extern volatile __bit                   C5ZLF               __at(0x4883);	// @ (0x910 * 8 + 3)
#define                                 C5ZLF_bit           _BIT_ACCESS(CM5CON0,3)
// CM6CON0<C6HYS>
extern volatile __bit                   C6HYS               __at(0x48A1);	// @ (0x914 * 8 + 1)
#define                                 C6HYS_bit           _BIT_ACCESS(CM6CON0,1)
// PIE5<C6IE>
extern volatile __bit                   C6IE                __at(0x4A9);	// @ (0x95 * 8 + 1)
#define                                 C6IE_bit            _BIT_ACCESS(PIE5,1)
// PIR5<C6IF>
extern volatile __bit                   C6IF                __at(0xA9);	// @ (0x15 * 8 + 1)
#define                                 C6IF_bit            _BIT_ACCESS(PIR5,1)
// CM6CON1<C6INTN>
extern volatile __bit                   C6INTN              __at(0x48A8);	// @ (0x915 * 8 + 0)
#define                                 C6INTN_bit          _BIT_ACCESS(CM6CON1,0)
// CM6CON1<C6INTP>
extern volatile __bit                   C6INTP              __at(0x48A9);	// @ (0x915 * 8 + 1)
#define                                 C6INTP_bit          _BIT_ACCESS(CM6CON1,1)
// CM6NSEL<C6NCH0>
extern volatile __bit                   C6NCH0              __at(0x48B0);	// @ (0x916 * 8 + 0)
#define                                 C6NCH0_bit          _BIT_ACCESS(CM6NSEL,0)
// CM6NSEL<C6NCH1>
extern volatile __bit                   C6NCH1              __at(0x48B1);	// @ (0x916 * 8 + 1)
#define                                 C6NCH1_bit          _BIT_ACCESS(CM6NSEL,1)
// CM6NSEL<C6NCH2>
extern volatile __bit                   C6NCH2              __at(0x48B2);	// @ (0x916 * 8 + 2)
#define                                 C6NCH2_bit          _BIT_ACCESS(CM6NSEL,2)
// CM6NSEL<C6NCH3>
extern volatile __bit                   C6NCH3              __at(0x48B3);	// @ (0x916 * 8 + 3)
#define                                 C6NCH3_bit          _BIT_ACCESS(CM6NSEL,3)
// CM6CON0<C6ON>
extern volatile __bit                   C6ON                __at(0x48A7);	// @ (0x914 * 8 + 7)
#define                                 C6ON_bit            _BIT_ACCESS(CM6CON0,7)
// CM6CON0<C6OUT>
extern volatile __bit                   C6OUT               __at(0x48A6);	// @ (0x914 * 8 + 6)
#define                                 C6OUT_bit           _BIT_ACCESS(CM6CON0,6)
// CM6PSEL<C6PCH0>
extern volatile __bit                   C6PCH0              __at(0x48B8);	// @ (0x917 * 8 + 0)
#define                                 C6PCH0_bit          _BIT_ACCESS(CM6PSEL,0)
// CM6PSEL<C6PCH1>
extern volatile __bit                   C6PCH1              __at(0x48B9);	// @ (0x917 * 8 + 1)
#define                                 C6PCH1_bit          _BIT_ACCESS(CM6PSEL,1)
// CM6PSEL<C6PCH2>
extern volatile __bit                   C6PCH2              __at(0x48BA);	// @ (0x917 * 8 + 2)
#define                                 C6PCH2_bit          _BIT_ACCESS(CM6PSEL,2)
// CM6PSEL<C6PCH3>
extern volatile __bit                   C6PCH3              __at(0x48BB);	// @ (0x917 * 8 + 3)
#define                                 C6PCH3_bit          _BIT_ACCESS(CM6PSEL,3)
// CM6CON0<C6POL>
extern volatile __bit                   C6POL               __at(0x48A4);	// @ (0x914 * 8 + 4)
#define                                 C6POL_bit           _BIT_ACCESS(CM6CON0,4)
// CM6CON0<C6SYNC>
extern volatile __bit                   C6SYNC              __at(0x48A0);	// @ (0x914 * 8 + 0)
#define                                 C6SYNC_bit          _BIT_ACCESS(CM6CON0,0)
// CM6CON0<C6ZLF>
extern volatile __bit                   C6ZLF               __at(0x48A3);	// @ (0x914 * 8 + 3)
#define                                 C6ZLF_bit           _BIT_ACCESS(CM6CON0,3)
// CCPTMRS1<C7TSEL0>
extern volatile __bit                   C7TSEL0             __at(0x14F4);	// @ (0x29E * 8 + 4)
#define                                 C7TSEL0_bit         _BIT_ACCESS(CCPTMRS1,4)
// CCPTMRS1<C7TSEL1>
extern volatile __bit                   C7TSEL1             __at(0x14F5);	// @ (0x29E * 8 + 5)
#define                                 C7TSEL1_bit         _BIT_ACCESS(CCPTMRS1,5)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x18);	// @ (0x3 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// CCP1CAP<CCP1CTS0>
extern volatile __bit                   CCP1CTS0            __at(0x14A0);	// @ (0x294 * 8 + 0)
#define                                 CCP1CTS0_bit        _BIT_ACCESS(CCP1CAP,0)
// CCP1CAP<CCP1CTS1>
extern volatile __bit                   CCP1CTS1            __at(0x14A1);	// @ (0x294 * 8 + 1)
#define                                 CCP1CTS1_bit        _BIT_ACCESS(CCP1CAP,1)
// CCP1CAP<CCP1CTS2>
extern volatile __bit                   CCP1CTS2            __at(0x14A2);	// @ (0x294 * 8 + 2)
#define                                 CCP1CTS2_bit        _BIT_ACCESS(CCP1CAP,2)
// CCP1CAP<CCP1CTS3>
extern volatile __bit                   CCP1CTS3            __at(0x14A3);	// @ (0x294 * 8 + 3)
#define                                 CCP1CTS3_bit        _BIT_ACCESS(CCP1CAP,3)
// CCP1CON<CCP1EN>
extern volatile __bit                   CCP1EN              __at(0x149F);	// @ (0x293 * 8 + 7)
#define                                 CCP1EN_bit          _BIT_ACCESS(CCP1CON,7)
// CCP1CON<CCP1FMT>
extern volatile __bit                   CCP1FMT             __at(0x149C);	// @ (0x293 * 8 + 4)
#define                                 CCP1FMT_bit         _BIT_ACCESS(CCP1CON,4)
// PIE1<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x48A);	// @ (0x91 * 8 + 2)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE1,2)
// PIR1<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x8A);	// @ (0x11 * 8 + 2)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR1,2)
// CCP1CON<CCP1MODE0>
extern volatile __bit                   CCP1MODE0           __at(0x1498);	// @ (0x293 * 8 + 0)
#define                                 CCP1MODE0_bit       _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1MODE1>
extern volatile __bit                   CCP1MODE1           __at(0x1499);	// @ (0x293 * 8 + 1)
#define                                 CCP1MODE1_bit       _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1MODE2>
extern volatile __bit                   CCP1MODE2           __at(0x149A);	// @ (0x293 * 8 + 2)
#define                                 CCP1MODE2_bit       _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1MODE3>
extern volatile __bit                   CCP1MODE3           __at(0x149B);	// @ (0x293 * 8 + 3)
#define                                 CCP1MODE3_bit       _BIT_ACCESS(CCP1CON,3)
// CCP1CON<CCP1OUT>
extern volatile __bit                   CCP1OUT             __at(0x149D);	// @ (0x293 * 8 + 5)
#define                                 CCP1OUT_bit         _BIT_ACCESS(CCP1CON,5)
// CCP2CAP<CCP2CTS0>
extern volatile __bit                   CCP2CTS0            __at(0x14C0);	// @ (0x298 * 8 + 0)
#define                                 CCP2CTS0_bit        _BIT_ACCESS(CCP2CAP,0)
// CCP2CAP<CCP2CTS1>
extern volatile __bit                   CCP2CTS1            __at(0x14C1);	// @ (0x298 * 8 + 1)
#define                                 CCP2CTS1_bit        _BIT_ACCESS(CCP2CAP,1)
// CCP2CAP<CCP2CTS2>
extern volatile __bit                   CCP2CTS2            __at(0x14C2);	// @ (0x298 * 8 + 2)
#define                                 CCP2CTS2_bit        _BIT_ACCESS(CCP2CAP,2)
// CCP2CAP<CCP2CTS3>
extern volatile __bit                   CCP2CTS3            __at(0x14C3);	// @ (0x298 * 8 + 3)
#define                                 CCP2CTS3_bit        _BIT_ACCESS(CCP2CAP,3)
// CCP2CON<CCP2EN>
extern volatile __bit                   CCP2EN              __at(0x14BF);	// @ (0x297 * 8 + 7)
#define                                 CCP2EN_bit          _BIT_ACCESS(CCP2CON,7)
// CCP2CON<CCP2FMT>
extern volatile __bit                   CCP2FMT             __at(0x14BC);	// @ (0x297 * 8 + 4)
#define                                 CCP2FMT_bit         _BIT_ACCESS(CCP2CON,4)
// PIE2<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x490);	// @ (0x92 * 8 + 0)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE2,0)
// PIR2<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x90);	// @ (0x12 * 8 + 0)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR2,0)
// CCP2CON<CCP2MODE0>
extern volatile __bit                   CCP2MODE0           __at(0x14B8);	// @ (0x297 * 8 + 0)
#define                                 CCP2MODE0_bit       _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2MODE1>
extern volatile __bit                   CCP2MODE1           __at(0x14B9);	// @ (0x297 * 8 + 1)
#define                                 CCP2MODE1_bit       _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2MODE2>
extern volatile __bit                   CCP2MODE2           __at(0x14BA);	// @ (0x297 * 8 + 2)
#define                                 CCP2MODE2_bit       _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2MODE3>
extern volatile __bit                   CCP2MODE3           __at(0x14BB);	// @ (0x297 * 8 + 3)
#define                                 CCP2MODE3_bit       _BIT_ACCESS(CCP2CON,3)
// CCP2CON<CCP2OUT>
extern volatile __bit                   CCP2OUT             __at(0x14BD);	// @ (0x297 * 8 + 5)
#define                                 CCP2OUT_bit         _BIT_ACCESS(CCP2CON,5)
// CCP7CAP<CCP7CTS0>
extern volatile __bit                   CCP7CTS0            __at(0x14E0);	// @ (0x29C * 8 + 0)
#define                                 CCP7CTS0_bit        _BIT_ACCESS(CCP7CAP,0)
// CCP7CAP<CCP7CTS1>
extern volatile __bit                   CCP7CTS1            __at(0x14E1);	// @ (0x29C * 8 + 1)
#define                                 CCP7CTS1_bit        _BIT_ACCESS(CCP7CAP,1)
// CCP7CAP<CCP7CTS2>
extern volatile __bit                   CCP7CTS2            __at(0x14E2);	// @ (0x29C * 8 + 2)
#define                                 CCP7CTS2_bit        _BIT_ACCESS(CCP7CAP,2)
// CCP7CAP<CCP7CTS3>
extern volatile __bit                   CCP7CTS3            __at(0x14E3);	// @ (0x29C * 8 + 3)
#define                                 CCP7CTS3_bit        _BIT_ACCESS(CCP7CAP,3)
// CCP7CON<CCP7EN>
extern volatile __bit                   CCP7EN              __at(0x14DF);	// @ (0x29B * 8 + 7)
#define                                 CCP7EN_bit          _BIT_ACCESS(CCP7CON,7)
// CCP7CON<CCP7FMT>
extern volatile __bit                   CCP7FMT             __at(0x14DC);	// @ (0x29B * 8 + 4)
#define                                 CCP7FMT_bit         _BIT_ACCESS(CCP7CON,4)
// PIE5<CCP7IE>
extern volatile __bit                   CCP7IE              __at(0x4AE);	// @ (0x95 * 8 + 6)
#define                                 CCP7IE_bit          _BIT_ACCESS(PIE5,6)
// PIR5<CCP7IF>
extern volatile __bit                   CCP7IF              __at(0xAE);	// @ (0x15 * 8 + 6)
#define                                 CCP7IF_bit          _BIT_ACCESS(PIR5,6)
// CCP7CON<CCP7MODE0>
extern volatile __bit                   CCP7MODE0           __at(0x14D8);	// @ (0x29B * 8 + 0)
#define                                 CCP7MODE0_bit       _BIT_ACCESS(CCP7CON,0)
// CCP7CON<CCP7MODE1>
extern volatile __bit                   CCP7MODE1           __at(0x14D9);	// @ (0x29B * 8 + 1)
#define                                 CCP7MODE1_bit       _BIT_ACCESS(CCP7CON,1)
// CCP7CON<CCP7MODE2>
extern volatile __bit                   CCP7MODE2           __at(0x14DA);	// @ (0x29B * 8 + 2)
#define                                 CCP7MODE2_bit       _BIT_ACCESS(CCP7CON,2)
// CCP7CON<CCP7MODE3>
extern volatile __bit                   CCP7MODE3           __at(0x14DB);	// @ (0x29B * 8 + 3)
#define                                 CCP7MODE3_bit       _BIT_ACCESS(CCP7CON,3)
// CCP7CON<CCP7OUT>
extern volatile __bit                   CCP7OUT             __at(0x14DD);	// @ (0x29B * 8 + 5)
#define                                 CCP7OUT_bit         _BIT_ACCESS(CCP7CON,5)
// PIE1<CCPIE>
extern volatile __bit                   CCPIE               __at(0x48A);	// @ (0x91 * 8 + 2)
#define                                 CCPIE_bit           _BIT_ACCESS(PIE1,2)
// PIR1<CCPIF>
extern volatile __bit                   CCPIF               __at(0x8A);	// @ (0x11 * 8 + 2)
#define                                 CCPIF_bit           _BIT_ACCESS(PIR1,2)
// PMCON1<CFGS>
extern volatile __bit                   CFGS                __at(0xCAE);	// @ (0x195 * 8 + 6)
#define                                 CFGS_bit            _BIT_ACCESS(PMCON1,6)
// SSP1STAT<CKE>
extern volatile __bit                   CKE                 __at(0x10A6);	// @ (0x214 * 8 + 6)
#define                                 CKE_bit             _BIT_ACCESS(SSP1STAT,6)
// SSP1CON1<CKP>
extern volatile __bit                   CKP                 __at(0x10AC);	// @ (0x215 * 8 + 4)
#define                                 CKP_bit             _BIT_ACCESS(SSP1CON1,4)
// PIE3<CLC1IE>
extern volatile __bit                   CLC1IE              __at(0x498);	// @ (0x93 * 8 + 0)
#define                                 CLC1IE_bit          _BIT_ACCESS(PIE3,0)
// PIR3<CLC1IF>
extern volatile __bit                   CLC1IF              __at(0x98);	// @ (0x13 * 8 + 0)
#define                                 CLC1IF_bit          _BIT_ACCESS(PIR3,0)
// PIE3<CLC2IE>
extern volatile __bit                   CLC2IE              __at(0x499);	// @ (0x93 * 8 + 1)
#define                                 CLC2IE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<CLC2IF>
extern volatile __bit                   CLC2IF              __at(0x99);	// @ (0x13 * 8 + 1)
#define                                 CLC2IF_bit          _BIT_ACCESS(PIR3,1)
// PIE3<CLC3IE>
extern volatile __bit                   CLC3IE              __at(0x49A);	// @ (0x93 * 8 + 2)
#define                                 CLC3IE_bit          _BIT_ACCESS(PIE3,2)
// PIR3<CLC3IF>
extern volatile __bit                   CLC3IF              __at(0x9A);	// @ (0x13 * 8 + 2)
#define                                 CLC3IF_bit          _BIT_ACCESS(PIR3,2)
// PIE3<CLC4IE>
extern volatile __bit                   CLC4IE              __at(0x49B);	// @ (0x93 * 8 + 3)
#define                                 CLC4IE_bit          _BIT_ACCESS(PIE3,3)
// PIR3<CLC4IF>
extern volatile __bit                   CLC4IF              __at(0x9B);	// @ (0x13 * 8 + 3)
#define                                 CLC4IF_bit          _BIT_ACCESS(PIR3,3)
// PIR2<COG1IF>
extern volatile __bit                   COG1IF              __at(0x94);	// @ (0x12 * 8 + 4)
#define                                 COG1IF_bit          _BIT_ACCESS(PIR2,4)
// PIE3<COG2IE>
extern volatile __bit                   COG2IE              __at(0x49D);	// @ (0x93 * 8 + 5)
#define                                 COG2IE_bit          _BIT_ACCESS(PIE3,5)
// PIR3<COG2IF>
extern volatile __bit                   COG2IF              __at(0x9D);	// @ (0x13 * 8 + 5)
#define                                 COG2IF_bit          _BIT_ACCESS(PIR3,5)
// PIE5<COG3IE>
extern volatile __bit                   COG3IE              __at(0x4AC);	// @ (0x95 * 8 + 4)
#define                                 COG3IE_bit          _BIT_ACCESS(PIE5,4)
// PIR5<COG3IF>
extern volatile __bit                   COG3IF              __at(0xAC);	// @ (0x15 * 8 + 4)
#define                                 COG3IF_bit          _BIT_ACCESS(PIR5,4)
// PIE2<COGIE>
extern volatile __bit                   COGIE               __at(0x494);	// @ (0x92 * 8 + 4)
#define                                 COGIE_bit           _BIT_ACCESS(PIE2,4)
// RC1STA<CREN>
extern volatile __bit                   CREN                __at(0xCEC);	// @ (0x19D * 8 + 4)
#define                                 CREN_bit            _BIT_ACCESS(RC1STA,4)
// TX1STA<CSRC>
extern volatile __bit                   CSRC                __at(0xCF7);	// @ (0x19E * 8 + 7)
#define                                 CSRC_bit            _BIT_ACCESS(TX1STA,7)
// STATUS_SHAD<C_SHAD>
extern volatile __bit                   C_SHAD              __at(0x7F20);	// @ (0xFE4 * 8 + 0)
#define                                 C_SHAD_bit          _BIT_ACCESS(STATUS_SHAD,0)
// DAC1CON0<DAC1EN>
extern volatile __bit                   DAC1EN              __at(0x2C77);	// @ (0x58E * 8 + 7)
#define                                 DAC1EN_bit          _BIT_ACCESS(DAC1CON0,7)
// DAC1CON0<DAC1FM>
extern volatile __bit                   DAC1FM              __at(0x2C76);	// @ (0x58E * 8 + 6)
#define                                 DAC1FM_bit          _BIT_ACCESS(DAC1CON0,6)
// DACLD<DAC1LD>
extern volatile __bit                   DAC1LD              __at(0x2C68);	// @ (0x58D * 8 + 0)
#define                                 DAC1LD_bit          _BIT_ACCESS(DACLD,0)
// DAC1CON0<DAC1NSS0>
extern volatile __bit                   DAC1NSS0            __at(0x2C70);	// @ (0x58E * 8 + 0)
#define                                 DAC1NSS0_bit        _BIT_ACCESS(DAC1CON0,0)
// DAC1CON0<DAC1NSS1>
extern volatile __bit                   DAC1NSS1            __at(0x2C71);	// @ (0x58E * 8 + 1)
#define                                 DAC1NSS1_bit        _BIT_ACCESS(DAC1CON0,1)
// DAC1CON0<DAC1OE1>
extern volatile __bit                   DAC1OE1             __at(0x2C75);	// @ (0x58E * 8 + 5)
#define                                 DAC1OE1_bit         _BIT_ACCESS(DAC1CON0,5)
// DAC1CON0<DAC1OE2>
extern volatile __bit                   DAC1OE2             __at(0x2C74);	// @ (0x58E * 8 + 4)
#define                                 DAC1OE2_bit         _BIT_ACCESS(DAC1CON0,4)
// DAC1CON0<DAC1PSS0>
extern volatile __bit                   DAC1PSS0            __at(0x2C72);	// @ (0x58E * 8 + 2)
#define                                 DAC1PSS0_bit        _BIT_ACCESS(DAC1CON0,2)
// DAC1CON0<DAC1PSS1>
extern volatile __bit                   DAC1PSS1            __at(0x2C73);	// @ (0x58E * 8 + 3)
