MikroElektronika/core_packages/PIC/XC8/def/PIC16F1776/mcu.h
#define                                 T6MODE2_bit         _BIT_ACCESS(T6HLT,2)
// T6HLT<T6MODE3>
extern volatile __bit                   T6MODE3             __at(0x20EB);	// @ (0x41D * 8 + 3)
#define                                 T6MODE3_bit         _BIT_ACCESS(T6HLT,3)
// T6HLT<T6MODE4>
extern volatile __bit                   T6MODE4             __at(0x20EC);	// @ (0x41D * 8 + 4)
#define                                 T6MODE4_bit         _BIT_ACCESS(T6HLT,4)
// T6CON<T6ON>
extern volatile __bit                   T6ON                __at(0x20E7);	// @ (0x41C * 8 + 7)
#define                                 T6ON_bit            _BIT_ACCESS(T6CON,7)
// T6CON<T6OUTPS0>
extern volatile __bit                   T6OUTPS0            __at(0x20E0);	// @ (0x41C * 8 + 0)
#define                                 T6OUTPS0_bit        _BIT_ACCESS(T6CON,0)
// T6CON<T6OUTPS1>
extern volatile __bit                   T6OUTPS1            __at(0x20E1);	// @ (0x41C * 8 + 1)
#define                                 T6OUTPS1_bit        _BIT_ACCESS(T6CON,1)
// T6CON<T6OUTPS2>
extern volatile __bit                   T6OUTPS2            __at(0x20E2);	// @ (0x41C * 8 + 2)
#define                                 T6OUTPS2_bit        _BIT_ACCESS(T6CON,2)
// T6CON<T6OUTPS3>
extern volatile __bit                   T6OUTPS3            __at(0x20E3);	// @ (0x41C * 8 + 3)
#define                                 T6OUTPS3_bit        _BIT_ACCESS(T6CON,3)
// T6HLT<T6PSYNC>
extern volatile __bit                   T6PSYNC             __at(0x20EF);	// @ (0x41D * 8 + 7)
#define                                 T6PSYNC_bit         _BIT_ACCESS(T6HLT,7)
// T6RST<T6RSEL0>
extern volatile __bit                   T6RSEL0             __at(0x20F8);	// @ (0x41F * 8 + 0)
#define                                 T6RSEL0_bit         _BIT_ACCESS(T6RST,0)
// T6RST<T6RSEL1>
extern volatile __bit                   T6RSEL1             __at(0x20F9);	// @ (0x41F * 8 + 1)
#define                                 T6RSEL1_bit         _BIT_ACCESS(T6RST,1)
// T6RST<T6RSEL2>
extern volatile __bit                   T6RSEL2             __at(0x20FA);	// @ (0x41F * 8 + 2)
#define                                 T6RSEL2_bit         _BIT_ACCESS(T6RST,2)
// T6RST<T6RSEL3>
extern volatile __bit                   T6RSEL3             __at(0x20FB);	// @ (0x41F * 8 + 3)
#define                                 T6RSEL3_bit         _BIT_ACCESS(T6RST,3)
// T6RST<T6RSEL4>
extern volatile __bit                   T6RSEL4             __at(0x20FC);	// @ (0x41F * 8 + 4)
#define                                 T6RSEL4_bit         _BIT_ACCESS(T6RST,4)
// T8HLT<T8CKPOL>
extern volatile __bit                   T8CKPOL             __at(0x24EE);	// @ (0x49D * 8 + 6)
#define                                 T8CKPOL_bit         _BIT_ACCESS(T8HLT,6)
// T8CON<T8CKPS0>
extern volatile __bit                   T8CKPS0             __at(0x24E4);	// @ (0x49C * 8 + 4)
#define                                 T8CKPS0_bit         _BIT_ACCESS(T8CON,4)
// T8CON<T8CKPS1>
extern volatile __bit                   T8CKPS1             __at(0x24E5);	// @ (0x49C * 8 + 5)
#define                                 T8CKPS1_bit         _BIT_ACCESS(T8CON,5)
// T8CON<T8CKPS2>
extern volatile __bit                   T8CKPS2             __at(0x24E6);	// @ (0x49C * 8 + 6)
#define                                 T8CKPS2_bit         _BIT_ACCESS(T8CON,6)
// T8HLT<T8CKSYNC>
extern volatile __bit                   T8CKSYNC            __at(0x24ED);	// @ (0x49D * 8 + 5)
#define                                 T8CKSYNC_bit        _BIT_ACCESS(T8HLT,5)
// T8CLKCON<T8CS0>
extern volatile __bit                   T8CS0               __at(0x24F0);	// @ (0x49E * 8 + 0)
#define                                 T8CS0_bit           _BIT_ACCESS(T8CLKCON,0)
// T8CLKCON<T8CS1>
extern volatile __bit                   T8CS1               __at(0x24F1);	// @ (0x49E * 8 + 1)
#define                                 T8CS1_bit           _BIT_ACCESS(T8CLKCON,1)
// T8CLKCON<T8CS2>
extern volatile __bit                   T8CS2               __at(0x24F2);	// @ (0x49E * 8 + 2)
#define                                 T8CS2_bit           _BIT_ACCESS(T8CLKCON,2)
// T8CLKCON<T8CS3>
extern volatile __bit                   T8CS3               __at(0x24F3);	// @ (0x49E * 8 + 3)
#define                                 T8CS3_bit           _BIT_ACCESS(T8CLKCON,3)
// T8HLT<T8MODE0>
extern volatile __bit                   T8MODE0             __at(0x24E8);	// @ (0x49D * 8 + 0)
#define                                 T8MODE0_bit         _BIT_ACCESS(T8HLT,0)
// T8HLT<T8MODE1>
extern volatile __bit                   T8MODE1             __at(0x24E9);	// @ (0x49D * 8 + 1)
#define                                 T8MODE1_bit         _BIT_ACCESS(T8HLT,1)
// T8HLT<T8MODE2>
extern volatile __bit                   T8MODE2             __at(0x24EA);	// @ (0x49D * 8 + 2)
#define                                 T8MODE2_bit         _BIT_ACCESS(T8HLT,2)
// T8HLT<T8MODE3>
extern volatile __bit                   T8MODE3             __at(0x24EB);	// @ (0x49D * 8 + 3)
#define                                 T8MODE3_bit         _BIT_ACCESS(T8HLT,3)
// T8HLT<T8MODE4>
extern volatile __bit                   T8MODE4             __at(0x24EC);	// @ (0x49D * 8 + 4)
#define                                 T8MODE4_bit         _BIT_ACCESS(T8HLT,4)
// T8CON<T8ON>
extern volatile __bit                   T8ON                __at(0x24E7);	// @ (0x49C * 8 + 7)
#define                                 T8ON_bit            _BIT_ACCESS(T8CON,7)
// T8CON<T8OUTPS0>
extern volatile __bit                   T8OUTPS0            __at(0x24E0);	// @ (0x49C * 8 + 0)
#define                                 T8OUTPS0_bit        _BIT_ACCESS(T8CON,0)
// T8CON<T8OUTPS1>
extern volatile __bit                   T8OUTPS1            __at(0x24E1);	// @ (0x49C * 8 + 1)
#define                                 T8OUTPS1_bit        _BIT_ACCESS(T8CON,1)
// T8CON<T8OUTPS2>
extern volatile __bit                   T8OUTPS2            __at(0x24E2);	// @ (0x49C * 8 + 2)
#define                                 T8OUTPS2_bit        _BIT_ACCESS(T8CON,2)
// T8CON<T8OUTPS3>
extern volatile __bit                   T8OUTPS3            __at(0x24E3);	// @ (0x49C * 8 + 3)
#define                                 T8OUTPS3_bit        _BIT_ACCESS(T8CON,3)
// T8HLT<T8PSYNC>
extern volatile __bit                   T8PSYNC             __at(0x24EF);	// @ (0x49D * 8 + 7)
#define                                 T8PSYNC_bit         _BIT_ACCESS(T8HLT,7)
// T8RST<T8RSEL0>
extern volatile __bit                   T8RSEL0             __at(0x24F8);	// @ (0x49F * 8 + 0)
#define                                 T8RSEL0_bit         _BIT_ACCESS(T8RST,0)
// T8RST<T8RSEL1>
extern volatile __bit                   T8RSEL1             __at(0x24F9);	// @ (0x49F * 8 + 1)
#define                                 T8RSEL1_bit         _BIT_ACCESS(T8RST,1)
// T8RST<T8RSEL2>
extern volatile __bit                   T8RSEL2             __at(0x24FA);	// @ (0x49F * 8 + 2)
#define                                 T8RSEL2_bit         _BIT_ACCESS(T8RST,2)
// T8RST<T8RSEL3>
extern volatile __bit                   T8RSEL3             __at(0x24FB);	// @ (0x49F * 8 + 3)
#define                                 T8RSEL3_bit         _BIT_ACCESS(T8RST,3)
// T8RST<T8RSEL4>
extern volatile __bit                   T8RSEL4             __at(0x24FC);	// @ (0x49F * 8 + 4)
#define                                 T8RSEL4_bit         _BIT_ACCESS(T8RST,4)
// OPTION_REG<TMR0CS>
extern volatile __bit                   TMR0CS              __at(0x4BD);	// @ (0x97 * 8 + 5)
#define                                 TMR0CS_bit          _BIT_ACCESS(OPTION_REG,5)
// INTCON<TMR0IE>
extern volatile __bit                   TMR0IE              __at(0x5D);	// @ (0xB * 8 + 5)
#define                                 TMR0IE_bit          _BIT_ACCESS(INTCON,5)
// INTCON<TMR0IF>
extern volatile __bit                   TMR0IF              __at(0x5A);	// @ (0xB * 8 + 2)
#define                                 TMR0IF_bit          _BIT_ACCESS(INTCON,2)
// OPTION_REG<TMR0SE>
extern volatile __bit                   TMR0SE              __at(0x4BC);	// @ (0x97 * 8 + 4)
#define                                 TMR0SE_bit          _BIT_ACCESS(OPTION_REG,4)
// T1CON<TMR1CS0>
extern volatile __bit                   TMR1CS0             __at(0xD6);	// @ (0x1A * 8 + 6)
#define                                 TMR1CS0_bit         _BIT_ACCESS(T1CON,6)
// T1CON<TMR1CS1>
extern volatile __bit                   TMR1CS1             __at(0xD7);	// @ (0x1A * 8 + 7)
#define                                 TMR1CS1_bit         _BIT_ACCESS(T1CON,7)
// T1GCON<TMR1GE>
extern volatile __bit                   TMR1GE              __at(0xDF);	// @ (0x1B * 8 + 7)
#define                                 TMR1GE_bit          _BIT_ACCESS(T1GCON,7)
// PIE1<TMR1GIE>
extern volatile __bit                   TMR1GIE             __at(0x48F);	// @ (0x91 * 8 + 7)
#define                                 TMR1GIE_bit         _BIT_ACCESS(PIE1,7)
// PIR1<TMR1GIF>
extern volatile __bit                   TMR1GIF             __at(0x8F);	// @ (0x11 * 8 + 7)
#define                                 TMR1GIF_bit         _BIT_ACCESS(PIR1,7)
// PIE1<TMR1IE>
extern volatile __bit                   TMR1IE              __at(0x488);	// @ (0x91 * 8 + 0)
#define                                 TMR1IE_bit          _BIT_ACCESS(PIE1,0)
// PIR1<TMR1IF>
extern volatile __bit                   TMR1IF              __at(0x88);	// @ (0x11 * 8 + 0)
#define                                 TMR1IF_bit          _BIT_ACCESS(PIR1,0)
// T1CON<TMR1ON>
extern volatile __bit                   TMR1ON              __at(0xD0);	// @ (0x1A * 8 + 0)
#define                                 TMR1ON_bit          _BIT_ACCESS(T1CON,0)
// PIE1<TMR2IE>
extern volatile __bit                   TMR2IE              __at(0x489);	// @ (0x91 * 8 + 1)
#define                                 TMR2IE_bit          _BIT_ACCESS(PIE1,1)
// PIR1<TMR2IF>
extern volatile __bit                   TMR2IF              __at(0x89);	// @ (0x11 * 8 + 1)
#define                                 TMR2IF_bit          _BIT_ACCESS(PIR1,1)
// T2CON<TMR2ON>
extern volatile __bit                   TMR2ON              __at(0x24AF);	// @ (0x495 * 8 + 7)
#define                                 TMR2ON_bit          _BIT_ACCESS(T2CON,7)
// T3CON<TMR3CS0>
extern volatile __bit                   TMR3CS0             __at(0xF6);	// @ (0x1E * 8 + 6)
#define                                 TMR3CS0_bit         _BIT_ACCESS(T3CON,6)
// T3CON<TMR3CS1>
extern volatile __bit                   TMR3CS1             __at(0xF7);	// @ (0x1E * 8 + 7)
#define                                 TMR3CS1_bit         _BIT_ACCESS(T3CON,7)
// T3GCON<TMR3GE>
extern volatile __bit                   TMR3GE              __at(0xFF);	// @ (0x1F * 8 + 7)
#define                                 TMR3GE_bit          _BIT_ACCESS(T3GCON,7)
// PIE4<TMR3GIE>
extern volatile __bit                   TMR3GIE             __at(0x4A3);	// @ (0x94 * 8 + 3)
#define                                 TMR3GIE_bit         _BIT_ACCESS(PIE4,3)
// PIR4<TMR3GIF>
extern volatile __bit                   TMR3GIF             __at(0xA3);	// @ (0x14 * 8 + 3)
#define                                 TMR3GIF_bit         _BIT_ACCESS(PIR4,3)
// PIE4<TMR3IE>
extern volatile __bit                   TMR3IE              __at(0x4A2);	// @ (0x94 * 8 + 2)
#define                                 TMR3IE_bit          _BIT_ACCESS(PIE4,2)
// PIR4<TMR3IF>
extern volatile __bit                   TMR3IF              __at(0xA2);	// @ (0x14 * 8 + 2)
#define                                 TMR3IF_bit          _BIT_ACCESS(PIR4,2)
// T3CON<TMR3ON>
extern volatile __bit                   TMR3ON              __at(0xF0);	// @ (0x1E * 8 + 0)
#define                                 TMR3ON_bit          _BIT_ACCESS(T3CON,0)
// PIE4<TMR4IE>
extern volatile __bit                   TMR4IE              __at(0x4A0);	// @ (0x94 * 8 + 0)
#define                                 TMR4IE_bit          _BIT_ACCESS(PIE4,0)
// PIR4<TMR4IF>
extern volatile __bit                   TMR4IF              __at(0xA0);	// @ (0x14 * 8 + 0)
#define                                 TMR4IF_bit          _BIT_ACCESS(PIR4,0)
// T4CON<TMR4ON>
extern volatile __bit                   TMR4ON              __at(0x20AF);	// @ (0x415 * 8 + 7)
#define                                 TMR4ON_bit          _BIT_ACCESS(T4CON,7)
// T5CON<TMR5CS0>
extern volatile __bit                   TMR5CS0             __at(0x208E);	// @ (0x411 * 8 + 6)
#define                                 TMR5CS0_bit         _BIT_ACCESS(T5CON,6)
// T5CON<TMR5CS1>
extern volatile __bit                   TMR5CS1             __at(0x208F);	// @ (0x411 * 8 + 7)
#define                                 TMR5CS1_bit         _BIT_ACCESS(T5CON,7)
// T5GCON<TMR5GE>
extern volatile __bit                   TMR5GE              __at(0x2097);	// @ (0x412 * 8 + 7)
#define                                 TMR5GE_bit          _BIT_ACCESS(T5GCON,7)
// PIE4<TMR5GIE>
extern volatile __bit                   TMR5GIE             __at(0x4A5);	// @ (0x94 * 8 + 5)
#define                                 TMR5GIE_bit         _BIT_ACCESS(PIE4,5)
// PIR4<TMR5GIF>
extern volatile __bit                   TMR5GIF             __at(0xA5);	// @ (0x14 * 8 + 5)
#define                                 TMR5GIF_bit         _BIT_ACCESS(PIR4,5)
// PIE4<TMR5IE>
extern volatile __bit                   TMR5IE              __at(0x4A4);	// @ (0x94 * 8 + 4)
#define                                 TMR5IE_bit          _BIT_ACCESS(PIE4,4)
// PIR4<TMR5IF>
extern volatile __bit                   TMR5IF              __at(0xA4);	// @ (0x14 * 8 + 4)
#define                                 TMR5IF_bit          _BIT_ACCESS(PIR4,4)
// T5CON<TMR5ON>
extern volatile __bit                   TMR5ON              __at(0x2088);	// @ (0x411 * 8 + 0)
#define                                 TMR5ON_bit          _BIT_ACCESS(T5CON,0)
// PIE4<TMR6IE>
extern volatile __bit                   TMR6IE              __at(0x4A1);	// @ (0x94 * 8 + 1)
#define                                 TMR6IE_bit          _BIT_ACCESS(PIE4,1)
// PIR4<TMR6IF>
extern volatile __bit                   TMR6IF              __at(0xA1);	// @ (0x14 * 8 + 1)
#define                                 TMR6IF_bit          _BIT_ACCESS(PIR4,1)
// T6CON<TMR6ON>
extern volatile __bit                   TMR6ON              __at(0x20E7);	// @ (0x41C * 8 + 7)
#define                                 TMR6ON_bit          _BIT_ACCESS(T6CON,7)
// PIE4<TMR8IE>
extern volatile __bit                   TMR8IE              __at(0x4A6);	// @ (0x94 * 8 + 6)
#define                                 TMR8IE_bit          _BIT_ACCESS(PIE4,6)
// PIR4<TMR8IF>
extern volatile __bit                   TMR8IF              __at(0xA6);	// @ (0x14 * 8 + 6)
#define                                 TMR8IF_bit          _BIT_ACCESS(PIR4,6)
// T8CON<TMR8ON>
extern volatile __bit                   TMR8ON              __at(0x24E7);	// @ (0x49C * 8 + 7)
#define                                 TMR8ON_bit          _BIT_ACCESS(T8CON,7)
// TRISA<TRISA0>
extern volatile __bit                   TRISA0              __at(0x460);	// @ (0x8C * 8 + 0)
#define                                 TRISA0_bit          _BIT_ACCESS(TRISA,0)
// TRISA<TRISA1>
extern volatile __bit                   TRISA1              __at(0x461);	// @ (0x8C * 8 + 1)
#define                                 TRISA1_bit          _BIT_ACCESS(TRISA,1)
// TRISA<TRISA2>
extern volatile __bit                   TRISA2              __at(0x462);	// @ (0x8C * 8 + 2)
#define                                 TRISA2_bit          _BIT_ACCESS(TRISA,2)
// TRISA<TRISA3>
extern volatile __bit                   TRISA3              __at(0x463);	// @ (0x8C * 8 + 3)
#define                                 TRISA3_bit          _BIT_ACCESS(TRISA,3)
// TRISA<TRISA4>
extern volatile __bit                   TRISA4              __at(0x464);	// @ (0x8C * 8 + 4)
#define                                 TRISA4_bit          _BIT_ACCESS(TRISA,4)
// TRISA<TRISA5>
extern volatile __bit                   TRISA5              __at(0x465);	// @ (0x8C * 8 + 5)
#define                                 TRISA5_bit          _BIT_ACCESS(TRISA,5)
// TRISA<TRISA6>
extern volatile __bit                   TRISA6              __at(0x466);	// @ (0x8C * 8 + 6)
#define                                 TRISA6_bit          _BIT_ACCESS(TRISA,6)
// TRISA<TRISA7>
extern volatile __bit                   TRISA7              __at(0x467);	// @ (0x8C * 8 + 7)
#define                                 TRISA7_bit          _BIT_ACCESS(TRISA,7)
// TRISB<TRISB0>
extern volatile __bit                   TRISB0              __at(0x468);	// @ (0x8D * 8 + 0)
#define                                 TRISB0_bit          _BIT_ACCESS(TRISB,0)
// TRISB<TRISB1>
extern volatile __bit                   TRISB1              __at(0x469);	// @ (0x8D * 8 + 1)
#define                                 TRISB1_bit          _BIT_ACCESS(TRISB,1)
// TRISB<TRISB2>
extern volatile __bit                   TRISB2              __at(0x46A);	// @ (0x8D * 8 + 2)
#define                                 TRISB2_bit          _BIT_ACCESS(TRISB,2)
// TRISB<TRISB3>
extern volatile __bit                   TRISB3              __at(0x46B);	// @ (0x8D * 8 + 3)
#define                                 TRISB3_bit          _BIT_ACCESS(TRISB,3)
// TRISB<TRISB4>
extern volatile __bit                   TRISB4              __at(0x46C);	// @ (0x8D * 8 + 4)
#define                                 TRISB4_bit          _BIT_ACCESS(TRISB,4)
// TRISB<TRISB5>
extern volatile __bit                   TRISB5              __at(0x46D);	// @ (0x8D * 8 + 5)
#define                                 TRISB5_bit          _BIT_ACCESS(TRISB,5)
// TRISB<TRISB6>
extern volatile __bit                   TRISB6              __at(0x46E);	// @ (0x8D * 8 + 6)
#define                                 TRISB6_bit          _BIT_ACCESS(TRISB,6)
// TRISB<TRISB7>
extern volatile __bit                   TRISB7              __at(0x46F);	// @ (0x8D * 8 + 7)
#define                                 TRISB7_bit          _BIT_ACCESS(TRISB,7)
// TRISC<TRISC0>
extern volatile __bit                   TRISC0              __at(0x470);	// @ (0x8E * 8 + 0)
#define                                 TRISC0_bit          _BIT_ACCESS(TRISC,0)
// TRISC<TRISC1>
extern volatile __bit                   TRISC1              __at(0x471);	// @ (0x8E * 8 + 1)
#define                                 TRISC1_bit          _BIT_ACCESS(TRISC,1)
// TRISC<TRISC2>
extern volatile __bit                   TRISC2              __at(0x472);	// @ (0x8E * 8 + 2)
#define                                 TRISC2_bit          _BIT_ACCESS(TRISC,2)
// TRISC<TRISC3>
extern volatile __bit                   TRISC3              __at(0x473);	// @ (0x8E * 8 + 3)
#define                                 TRISC3_bit          _BIT_ACCESS(TRISC,3)
// TRISC<TRISC4>
extern volatile __bit                   TRISC4              __at(0x474);	// @ (0x8E * 8 + 4)
#define                                 TRISC4_bit          _BIT_ACCESS(TRISC,4)
// TRISC<TRISC5>
extern volatile __bit                   TRISC5              __at(0x475);	// @ (0x8E * 8 + 5)
#define                                 TRISC5_bit          _BIT_ACCESS(TRISC,5)
// TRISC<TRISC6>
extern volatile __bit                   TRISC6              __at(0x476);	// @ (0x8E * 8 + 6)
#define                                 TRISC6_bit          _BIT_ACCESS(TRISC,6)
// TRISC<TRISC7>
extern volatile __bit                   TRISC7              __at(0x477);	// @ (0x8E * 8 + 7)
#define                                 TRISC7_bit          _BIT_ACCESS(TRISC,7)
// TRISE<TRISE3>
extern volatile __bit                   TRISE3              __at(0x483);	// @ (0x90 * 8 + 3)
#define                                 TRISE3_bit          _BIT_ACCESS(TRISE,3)
// TX1STA<TRMT>
extern volatile __bit                   TRMT                __at(0xCF1);	// @ (0x19E * 8 + 1)
#define                                 TRMT_bit            _BIT_ACCESS(TX1STA,1)
// FVRCON<TSEN>
extern volatile __bit                   TSEN                __at(0x4F5);	// @ (0x9E * 8 + 5)
#define                                 TSEN_bit            _BIT_ACCESS(FVRCON,5)
// FVRCON<TSRNG>
extern volatile __bit                   TSRNG               __at(0x4F4);	// @ (0x9E * 8 + 4)
#define                                 TSRNG_bit           _BIT_ACCESS(FVRCON,4)
// OSCTUNE<TUN0>
extern volatile __bit                   TUN0                __at(0x4D0);	// @ (0x9A * 8 + 0)
#define                                 TUN0_bit            _BIT_ACCESS(OSCTUNE,0)
// OSCTUNE<TUN1>
extern volatile __bit                   TUN1                __at(0x4D1);	// @ (0x9A * 8 + 1)
#define                                 TUN1_bit            _BIT_ACCESS(OSCTUNE,1)
// OSCTUNE<TUN2>
extern volatile __bit                   TUN2                __at(0x4D2);	// @ (0x9A * 8 + 2)
#define                                 TUN2_bit            _BIT_ACCESS(OSCTUNE,2)
// OSCTUNE<TUN3>
extern volatile __bit                   TUN3                __at(0x4D3);	// @ (0x9A * 8 + 3)
#define                                 TUN3_bit            _BIT_ACCESS(OSCTUNE,3)
// OSCTUNE<TUN4>
extern volatile __bit                   TUN4                __at(0x4D4);	// @ (0x9A * 8 + 4)
#define                                 TUN4_bit            _BIT_ACCESS(OSCTUNE,4)
// OSCTUNE<TUN5>
extern volatile __bit                   TUN5                __at(0x4D5);	// @ (0x9A * 8 + 5)
#define                                 TUN5_bit            _BIT_ACCESS(OSCTUNE,5)
// TX1STA<TX9>
extern volatile __bit                   TX9                 __at(0xCF6);	// @ (0x19E * 8 + 6)
#define                                 TX9_bit             _BIT_ACCESS(TX1STA,6)
// TX1STA<TX9D>
extern volatile __bit                   TX9D                __at(0xCF0);	// @ (0x19E * 8 + 0)
#define                                 TX9D_bit            _BIT_ACCESS(TX1STA,0)
// TX1STA<TXEN>
extern volatile __bit                   TXEN                __at(0xCF5);	// @ (0x19E * 8 + 5)
#define                                 TXEN_bit            _BIT_ACCESS(TX1STA,5)
// PIE1<TXIE>
extern volatile __bit                   TXIE                __at(0x48C);	// @ (0x91 * 8 + 4)
#define                                 TXIE_bit            _BIT_ACCESS(PIE1,4)
// PIR1<TXIF>
extern volatile __bit                   TXIF                __at(0x8C);	// @ (0x11 * 8 + 4)
#define                                 TXIF_bit            _BIT_ACCESS(PIR1,4)
// SSP1STAT<UA>
extern volatile __bit                   UA                  __at(0x10A1);	// @ (0x214 * 8 + 1)
#define                                 UA_bit              _BIT_ACCESS(SSP1STAT,1)
// VREGCON<VREGPM0>
extern volatile __bit                   VREGPM0             __at(0xCB8);	// @ (0x197 * 8 + 0)
#define                                 VREGPM0_bit         _BIT_ACCESS(VREGCON,0)
// VREGCON<VREGPM1>
extern volatile __bit                   VREGPM1             __at(0xCB9);	// @ (0x197 * 8 + 1)
#define                                 VREGPM1_bit         _BIT_ACCESS(VREGCON,1)
// SSP1CON1<WCOL>
extern volatile __bit                   WCOL                __at(0x10AF);	// @ (0x215 * 8 + 7)
#define                                 WCOL_bit            _BIT_ACCESS(SSP1CON1,7)
// WDTCON<WDTPS0>
extern volatile __bit                   WDTPS0              __at(0x4C9);	// @ (0x99 * 8 + 1)
#define                                 WDTPS0_bit          _BIT_ACCESS(WDTCON,1)
// WDTCON<WDTPS1>
extern volatile __bit                   WDTPS1              __at(0x4CA);	// @ (0x99 * 8 + 2)
#define                                 WDTPS1_bit          _BIT_ACCESS(WDTCON,2)
// WDTCON<WDTPS2>
extern volatile __bit                   WDTPS2              __at(0x4CB);	// @ (0x99 * 8 + 3)
#define                                 WDTPS2_bit          _BIT_ACCESS(WDTCON,3)
// WDTCON<WDTPS3>
